[
	{
		"count": 15,
		"next": "https://663d7041e1913c476794463b.mockapi.io/jobs?page=2&limit=1",
		"previous": null,
		"results": [
			{
				"id": "Xxq6rYn",
				"role": "Product Designer",
				"company_name": "Zen Educate",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/Xxq6rYn/product-designer-at-zen-educate",
				"text": "<p><strong>Location: London (Oval), incl. flex, United Kingdom</strong></p><p><strong>Type: Full-time</strong></p><p><strong>Salary: £50,000- £65,000</strong></p><p><strong>About us:</strong></p><p>Zen is revolutionising education. Schools spend over £2bn a year on agency staff, and £600m of that goes straight into the pockets of recruitment agencies. That’s why we’ve built an alternative. </p><p>Our online platform gives schools instant access to hundreds of profiles of fully vetted teachers and support staff. Since launching in 2017, we’ve saved schools over £10m – money that goes straight back into school budgets and increases teachers’ pay.</p><p><strong>The opportunity:</strong></p><p>This is your chance to join a tech startup in hypergrowth. We’re passionate about professional development, and we’ll work to maximise your personal and career growth.</p><p><strong>Looking to make a difference?</strong></p><p>You’ll be joining Zen in a key position. Product is at the heart of how we deliver for schools and teachers and you’ll play a key role in building and running our product function to make sure we are creating the right thing and doing it right. We’re still young and you’ll play a significant role in the development of the company and team.</p><p>The product delivery team is a crucial part of how Zen will help both transform the supply and recruitment experience for schools and generate the savings the education system needs. This is a great opportunity for someone looking to apply themselves for a great cause and with great responsibility and autonomy to shape the product for years to come.</p><p><strong>What we are looking for</strong></p><p>- Top performer that wants to be part of a high-performing, motivated team</p><p>- Growth mindset – dedicated to improving your skills as a professional </p><p>- Passion for building great products and companies that have a positive social impact </p><p>- Strong bias to action</p><p>- Excellent people skills for working with both our customers and teams at Zen</p><p><strong>What you’ll be doing</strong></p><p>Working on both our core platform at Zen Educate & Zen Locum as well as our additional software services, you will be:</p><p>- Working in a multidisciplinary delivery team</p><p>- Conducting Customer Research</p><p>- Making designs, prototyping and wireframing</p><p>- Working with and building design systems</p><p>- Working closely with developers and product managers to test designs and see them to production as intended</p><p><strong>Ideal experience</strong></p><p>- UX/UI design experience including wire-framing, building high-fidelity mock-ups, and applying design thinking to solve business problems</p><p>- Experience with Figma and Adobe Creative Suite</p><p>- Some knowledge of HTML/CSS, Sketch is a plus</p><p>- Prior experience designing and building products</p><p>- Strong communication skills, comfortable walking through designs to the team and the company</p><p>- History of creating products with strong user experience and high-quality design</p><p><strong>What's in it for you?</strong></p><p>- Work that you want to talk about</p><p>- Competitive salary</p><p>- Ownership in the company</p><p>- 25 days of holiday</p><p>- Central London office with perks like fresh fruit, yoga classes, bike parking, showers and an on-site gym and café</p><p>- Fun-loving, tight-knit team solving a problem that makes a difference</p><p>- 1-1 coaching</p><p>- Life Insurance</p><p>- Health Insurance</p><p>- Electric Car Scheme </p><p>- Cycle to Work Scheme </p><p><strong>We can’t wait to hear from you!</strong></p><p><strong>Diversity and Inclusion</strong></p><p>At Zen, we strive to build a culture of equity and inclusion, where everyone is respected, valued and appreciated for their unique traits, experiences and perspectives. We are committed to creating a safe, inclusive and equitable environment where our team can thrive, regardless of age, ethnicity, race, gender identity, sexual orientation, socio-economic status, disability, religion or beliefs. We value our differences and believe that practices of Diversity, Equity and Inclusion help us create a fairer, more compassionate environment for all. </p><p>We welcome applicants with diverse backgrounds and different experiences and perspectives — just like the staff who teach through Zen and the children at the schools we work with. We believe in hiring the best people from the widest pool and creating an inclusive culture where people’s voices are heard and all our team can look forward to coming to work. </p><p>We are committed to building a team that reflects the diversity of our community and promoting an equitable and inclusive environment for all. We seek out diverse opinions, beliefs, and experiences because they collectively make us stronger; we’ve had former teachers, pilots, fundraisers, engineers, lawyers, marketers, social media experts and more join our team.</p>",
				"date_posted": "2024-05-03T10:23:01Z",
				"keywords": [
					"ux",
					"figma",
					"sketch"
				],
				"source": "Dribbble"
			},
			{
				"id": "MrJKbKM",
				"role": "Engineer",
				"company_name": "Aldara",
				"company_num_employees": null,
				"employment_type": null,
				"location": "Onsite (Barcelona, Spain)",
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/MrJKbKM/engineer-at-aldara",
				"text": "Hi, I&#x27;m Dani, Aldara cofounder. At Aldara we build software to manage HOAs and handle everything they need in their day-to-day. We make neighbor communities happy by handling their finances, incidents, and communications swiftly and effectively. We invest heavily in product and growth to become the building OS for the European real estate market.<br>Right now the eng team is made up of three very efficient, independent engineers who have built 5 products to support the customer&#x27;s needs. We value a high sense of ownership and relentless curiosity. We want passionate builders who we also love as human beings. Join us pre series A for a significant stake in the game!<br>See more about the offer here <a href=\"https:&#x2F;&#x2F;www.ycombinator.com&#x2F;companies&#x2F;aldara&#x2F;jobs&#x2F;4DCmIVs-software-engineer\">https:&#x2F;&#x2F;www.ycombinator.com&#x2F;companies&#x2F;aldara&#x2F;jobs&#x2F;4DCmIVs-so...</a><br>Work is on site, working level of spanish is recommended. We&#x27;re not doing visas at the moment.",
				"date_posted": "2024-05-03T09:09:30Z",
				"keywords": [
					"moment"
				],
				"source": "Hn"
			},
			{
				"id": "nKJgl5X",
				"role": "Senior Platform Engineer",
				"company_name": "SurrealDB",
				"company_num_employees": null,
				"employment_type": null,
				"location": "London, UK",
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/nKJgl5X/senior-platform-engineer-at-surrealdb",
				"text": "We are hiring at SurrealDB if anyone is interested in Databases.<br>We are building a modern multi-modal distributed OLTP DB from scratch. Massive adoption already and a very ambitious roadmap.<br>I&#x27;m looking for people that can help us build the Cloud offering, focusing on Infrastructure automation and reliability.<br>We have an office in London and also accept remote (European timezone preferably)<br>If interested, apply here: <a href=\"https:&#x2F;&#x2F;careers.surrealdb.com&#x2F;senior-platform-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.surrealdb.com&#x2F;senior-platform-engineer</a>",
				"date_posted": "2024-05-03T08:03:49Z",
				"keywords": [],
				"source": "Hn"
			},
			{
				"id": "XRLKWxQ",
				"role": "Field Engineering Senior Manager",
				"company_name": "Dynamo AI",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/1cda360e2326432aa29372700cb8d12b54600df4.jpg",
				"url": "https://findwork.dev/XRLKWxQ/field-engineering-senior-manager-at-dynamo-ai",
				"text": "<p><strong>→ UPDATE: Only applications submitted to <a href=\"https://dynamo.ai/apply-now\"><strong>https://dynamo.ai/apply-now</strong></a> will be considered.</strong></p>\n<p>We are seeking a strategic and innovative Field Engineering Senior Manager to build our Field Engineering team. Reporting directly to the Head of Growth, you will be responsible for driving technical sales strategies, enabling customers to successfully integrate our AI solutions into their environments, and ensuring the highest levels of customer satisfaction.​​</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>\n<strong>Build and Lead Field Engineering Team:</strong> Develop the structure and processes for the Field Engineering team, including hiring, onboarding, and mentoring team members.​</li>\n<li>\n<strong>Technical Sales Leadership:</strong> Collaborate with the Sales team to develop and execute technical sales strategies that drive revenue growth and meet company objectives.​</li>\n<li>\n<strong>Customer Engagement:</strong> Engage directly with customers to understand their technical requirements, demonstrate product capabilities, and assist in solution design.​</li>\n<li>\n<strong>Product Alignment:</strong> Work closely with Product Management and Engineering teams to ensure that technical sales processes and approaches are aligned with the product vision and capabilities.</li>\n<li>\n<strong>Product Evangelism:</strong> Act as a technical evangelist for our products, showcasing their value and differentiation in the market through presentations, demos, and other means.​</li>\n<li>\n<strong>Cross-Functional Collaboration:</strong> Collaborate with Product Management, Engineering, and Customer Success teams to ensure alignment between customer requirements and product development.​</li>\n<li>\n<strong>Continuous Improvement:</strong> Identify areas for improvement in the sales process, product offerings, and customer engagement to drive continuous improvement and innovation.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor’s degree in Computer Science, Engineering, or a related field. Master’s degree preferred.​</li>\n<li>8+ years of experience in a technical pre-sales or field engineering role, with at least 3 years in a leadership capacity.​</li>\n<li>Deep understanding and hands-on experience with AI, machine learning, and cloud computing technologies.​</li>\n<li>Proficiency in container technologies such as Docker and Kubernetes, with experience in deploying and managing containerized applications.​</li>\n<li>Proven track record of leading successful technical sales engagements and driving revenue growth.​</li>\n<li>Strong communication and presentation skills, with the ability to effectively convey technical concepts to non-technical audiences.​</li>\n<li>Experience working with cross-functional teams in a fast-paced, dynamic environment.​</li>\n<li>Strong leadership and team-building skills, with a focus on developing and growing a high-performing team.</li>\n</ul>\n",
				"date_posted": "2024-05-03T07:56:29Z",
				"keywords": [
					"docker",
					"kubernetes"
				],
				"source": "Ycombinator"
			},
			{
				"id": "Mb9RdgQ",
				"role": "Customer Success Senior Manager",
				"company_name": "Dynamo AI",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/1cda360e2326432aa29372700cb8d12b54600df4.jpg",
				"url": "https://findwork.dev/Mb9RdgQ/customer-success-senior-manager-at-dynamo-ai",
				"text": "<p><strong>→ UPDATE: Only applications submitted to <a href=\"https://dynamo.ai/apply-now\"><strong>https://dynamo.ai/apply-now</strong></a> will be considered.</strong></p>\n<p>We are seeking a strategic Customer Success Senior Manager to build our Customer Success team. Reporting directly to the Head of Growth, you will be responsible for fostering long-term relationships with our clients, ensuring their success and satisfaction with our AI solutions, along with driving customer retention and growth.​</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>\n<strong>Build and lead Customer Success Team:</strong> Build and lead the Customer Success team, providing guidance and support to ensure the team delivers exceptional service and support to our clients.​</li>\n<li>\n<strong>Customer Relationship Management:</strong> Develop and maintain relationships with key clients, serving as the primary point of contact for escalations and strategic discussions.​</li>\n<li>\n<strong>Customer Onboarding and Adoption:</strong> Oversee the customer onboarding process to ensure a smooth transition from Sales to Customer Success. Implement strategies that drive product adoption and utilization.​</li>\n<li>\n<strong>Customer Advocacy:</strong> Act as the voice of the customer within the company, ensuring that customer feedback is heard and acted upon to improve product offerings and customer experience.​</li>\n<li>\n<strong>Retention and Growth Strategies:</strong> Develop and execute strategies to increase customer retention and reduce churn. Identify upsell and cross-sell opportunities by understanding customer needs and aligning them with our product offerings.​</li>\n<li>\n<strong>Performance Management:</strong> Establish key performance indicators (KPIs) for the Customer Success team and regularly track and report on these metrics to assess team performance and customer health.​</li>\n<li>\n<strong>Cross-Functional Collaboration:</strong> Collaborate with Sales, Product Management, and Engineering teams to ensure alignment between customer requirements and product development.​</li>\n<li>\n<strong>Continuous Improvement:</strong> Identify areas for improvement in the customer experience and customer success processes, driving continuous improvement and innovation.​</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>Bachelor’s degree in Business Administration, Marketing, or a related field.​</li>\n<li>At least 8-10 years of experience in customer success or a related field, with a proven track record of leading a customer success team in a technology-driven environment.​</li>\n<li>Strong understanding of customer success metrics and the ability to link them to business outcomes.​</li>\n<li>Excellent interpersonal and communication skills, with the ability to build relationships and influence both customers and internal stakeholders.​</li>\n<li>Demonstrated ability to manage and inspire a team in a dynamic and fast-paced setting.​</li>\n<li>Proficient in CRM and Customer Success software platforms such as Salesforce or Hubspot</li>\n</ul>\n",
				"date_posted": "2024-05-03T07:51:39Z",
				"keywords": [
					"hubspot",
					"salesforce"
				],
				"source": "Ycombinator"
			},
			{
				"id": "MBjRD7M",
				"role": "Marketing Designer (Part-time/Freelance)",
				"company_name": "BRYTER",
				"company_num_employees": "11-50",
				"employment_type": "contract",
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/BRYTER",
				"url": "https://findwork.dev/MBjRD7M/marketing-designer-part-timefreelance-at-bryter",
				"text": "<p>As a remote, freelance Marketing Designer at BRYTER you will play a key role in developing and executing visually engaging marketing materials. Working closely with others in the Marketing Team (Content, Demand Generation, Technical Website Manager) you will contribute to creating a creative, engaging and consistent brand identity across various channels – from paid social campaigns to e-books and webpages.</p><p>You are a high-energy designer who enjoys the challenges and opportunities B2B marketing presents. In a world of boring stock photos, you like to be the one creating a visual aesthetic that pushes boundaries and brings fun, energy and creativity into B2B Marketing (and to the legal and compliance industries!), while doing so in a way consistent with the brand.</p><p>In this role you will report directly to the VP of Marketing and work closely with the founders and the Product Design team as the person responsible for the visual aesthetic of the BRYTER brand.</p><p>We initially expect this role to be part-time (i.e., 3 days per week).</p><p></p><p></p><p><strong>What you’ll do</strong></p><ul><li><p>Develop engaging and visually striking assets to support marketing efforts across platforms and channels: paid social media campaigns (LinkedIn Ads), collateral (e.g., e-books and PDFs), presentations and landing pages.</p></li><li><p>Create elements for our website and landing pages.</p></li><li><p>Work closely with others in the Marketing Team: Content, Demand Generation and our Technical Website Owner, as well as cross-functionally (Product Design) and directly with the founders to create assets that support our Marketing Strategy.</p></li><li><p>Manage and execute on multiple projects, deadlines and communication in a fast-moving start-up environment.</p></li></ul><p> </p><p><strong>What we’re looking for</strong></p><ul><li><p>A strong portfolio that shows your visual design skills.</p></li><li><p>3+ years in marketing design roles (or similar).</p></li><li><p>The ability to bring energy and creativity to a traditional industry (Legal/ Compliance and B2B).</p></li><li><p>Digital and print expertise: trained in creating assets for both digital and print mediums.</p></li><li><p>Strong communication skills, both written and verbal.</p></li><li><p>Fluent English speaker</p></li></ul><p> </p><p><strong>What is it like to work at BRYTER?</strong> </p><p>We are a remote-first Software-as-a-Service company, with people across UK, Europe, and the USA. We believe that teams are more important than businesses and we are convinced that the right team can have the greatest impact. Our management team has successfully built, scaled and sold companies before and wants to create an environment where everyone can grow to their full potential and flourish. </p><p>We want our team members to take responsibility, to understand the mission and, ultimately, to be happy. That is why our organization is optimized to foster employee happiness, allowing everyone to have as much ownership, autonomy and mastery as possible. If you want to hear it straight from the horse’s mouth on what this means, how working at BRYTER is like, our CPO and Co-Founder Michael Hübl has <a href=\"https://bryter.io/press-news/how-to-remote-with-bryter/\" rel=\"nofollow noreferrer\"><strong>recorded a webinar</strong></a>, where he shares a bit about our remote-first working culture. </p><p>Being remote-first means we work extra hard to foster relationships, including weekly check-ins, at a team and company level, and an in-person get-together twice per year where we spend the time strategizing, planning as well as just talking, having fun and getting to know each other better. Last time we did this was in Tuscany, and prior to that it was on a beach in Portugal!</p>",
				"date_posted": "2024-05-03T05:58:06Z",
				"keywords": [],
				"source": "Dribbble"
			},
			{
				"id": "MmjbKLX",
				"role": "Designer",
				"company_name": "Prepaire Laboratory",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/MmjbKLX/designer-at-prepaire-laboratory",
				"text": "<p>We're looking for an experienced UX/UI designer who can design a whole web/app.</p><p>Send us a DM or email your CVs/Portfolios to <a href=\"mailto:accounts@prepaire.com\" rel=\"nofollow noreferrer\">accounts@prepaire.com</a>. Make sure to mention your starting date, if hired. </p><p>Note: We are NOT looking for a design firm, we need an individual designer.</p><p></p>",
				"date_posted": "2024-05-03T05:54:55Z",
				"keywords": [
					"ux"
				],
				"source": "Dribbble"
			},
			{
				"id": "MdVyvpn",
				"role": "Senior Front End Engineer",
				"company_name": "holi.social",
				"company_num_employees": null,
				"employment_type": null,
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/MdVyvpn/senior-front-end-engineer-at-holisocial",
				"text": "Hi, Daniel here, Head of Engineering @ <a href=\"https:&#x2F;&#x2F;holi.social\" rel=\"nofollow\">https:&#x2F;&#x2F;holi.social</a>. holi is the digital space where people and organisations come together to act for common good. We&#x27;re dedicated to fostering a new digital ecosystem that empowers people to engage in impactful social projects while providing a digital home for social initiatives.<br>Go check it out at\nPlay Store: <a href=\"https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=social.holi.ap\">https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=social.holi.ap</a>...\nApp Store: <a href=\"https:&#x2F;&#x2F;apps.apple.com&#x2F;xk&#x2F;app&#x2F;holi-social-eco-impact&#x2F;id64466\" rel=\"nofollow\">https:&#x2F;&#x2F;apps.apple.com&#x2F;xk&#x2F;app&#x2F;holi-social-eco-impact&#x2F;id64466</a>...\nWeb: <a href=\"https:&#x2F;&#x2F;app.holi.social\" rel=\"nofollow\">https:&#x2F;&#x2F;app.holi.social</a><br>We&#x27;re on the lookout for a *Senior Front End Engineer* to join our growing tech team and be a part of our inspiring journey:\n<a href=\"https:&#x2F;&#x2F;projectholi.jobs.personio.de&#x2F;job&#x2F;1499620?language=de&amp;display=en\" rel=\"nofollow\">https:&#x2F;&#x2F;projectholi.jobs.personio.de&#x2F;job&#x2F;1499620?language=de...</a>...<br>The front ends are being developed cross-platform in TypeScript using React Native for mobile in combination with React Native for Web and Next.JS for web. The backend consists of a mix of a few open-source components in different languages (currently mostly TypeScript &amp; Python). We use Google Cloud Platform (GCP) as a cloud provider and Terraform for provisioning our services.<br>At holi, our team truly values a workplace where we can openly communicate and connect, using language that includes everyone. We appreciate the different perspectives that team members bring, and we create an atmosphere where new ideas are welcome. Learning is a continuous journey, and we&#x27;re all about sharing knowledge and making decisions together. We&#x27;re a close-knit team, helping and supporting each other while keeping things simple and practical rather than seeking perfection. We have zero tolerance for toxic or egoistic behavior, as we prioritize collaboration and positivity. Our main focus is on making a positive impact and prioritizing people over profits.",
				"date_posted": "2024-05-03T04:11:46Z",
				"keywords": [
					"gcp",
					"typescript",
					"terraform",
					"react",
					"python"
				],
				"source": "Hn"
			},
			{
				"id": "XzZzRbX",
				"role": "Investment & Research Analyst",
				"company_name": "Chorus One",
				"company_num_employees": "1-10",
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/9854badd84c87f1efdda3c8c28ad8a8b82951c02.jpg",
				"url": "https://findwork.dev/XzZzRbX/investment-research-analyst-at-chorus-one",
				"text": "<h2>About Us</h2><p>Chorus One is one of the leading operators of infrastructure for Proof-of-Stake networks and decentralized protocols. Tens of thousands of retail customers and institutions are staking billions in assets through our infrastructure helping to secure protocols and earn rewards. Our mission is to increase freedom and speed of innovation through decentralized technologies. We are a diverse team of around 60 people distributed all over the globe. We value radical transparency, striving for excellence and improvement while treating each other with kindness and generosity. If this sounds like you, we’d love to hear from you.</p><p>We are hiring an <strong>Investment & Research Analyst</strong> to join our fully remote team to focus on early-stage investment opportunities for Chorus One Ventures. As an <strong>Investment & Research Analyst</strong> you will spend time sourcing, analyzing, and evaluating investment opportunities, while also working closely with portfolio companies & network foundations. Identifying, analyzing, and understanding new markets & technology trends within the blockchain industry will be a core part of your work. This is an exciting chance to work in an established, ambitious, and highly collaborative team, and to take on significant responsibility quickly.</p><h2>Responsibilities</h2><ul><li>Sourcing and proactively identifying new investment opportunities</li><li>Qualifying inbound leads for Chorus One Ventures by meeting with founders</li><li>Evaluate and diligence new investment opportunities through conversations, market research, technology/architecture reviews, competitive analysis, etc.</li><li>Help maintain our database and deal pipeline with current information</li><li>Be responsible for the qualitative and quantitative analysis of various investment opportunities</li><li>Conduct deep research within areas of focus and help synthesize learnings into insightful content</li><li>Assist in supporting Chorus One portfolio companies and help maintain & build relationships with various network foundations for dealflow & staking opportunities</li><li>Support the rest of the ventures team in due diligence procedures, research and financial modeling</li><li>Pitching in on various firm related projects</li></ul><h2>What you offer</h2><ul><li>Self-starter mentality with a proven ability to take initiative and operate with little oversight / be self-guided on a day-to-day basis</li><li>A demonstrated history of being proactive and being a strong team player who fits in with our team’s low-ego culture</li><li>Ability to digest new technical, market & other industry information quickly and precisely</li><li>Strong written and verbal analytical & communication skills for deal analysis and internal reporting</li><li>A native understanding of blockchain technology with experience reviewing white papers or crypto projects</li><li>Deep understanding of one or more subareas of crypto infrastructure or related technical fields, such as consensus, L2s, economics, decentralized storage, etc.</li><li>The ability to think analytically and strategically about investment decisions and ongoing work with existing portfolio companies</li><li>Strong relationship building skills as we are connecting with entrepreneurs and other members of the community on a regular basis</li><li>An active user of crypto applications and protocols</li><li>Financial modeling capability or data science background is a plus</li><li>Experience working for a crypto venture firm and understand venture capital and crypto deal terms is a plus</li></ul><p>Job Type: Full-time</p><h2>Benefits</h2><ul><li>Autonomy, a friendly and supportive work environment and the opportunity for rapid growth</li><li>Competitive fixed salary (USD 85k - USD 130k) + equity</li><li>Learning Budget 3,000 CHF / year</li><li>Conference Budget</li><li>Unlimited PTO</li><li>All-expense paid bi-annual team retreats at nice destinations. Past retreats took place in Portugal, Kenya, USA, South Korea, Dubai, Georgia, Thailand, Serbia.</li><li>Remote, but not alone. We are a strong global collaborative team</li><li>Expand your network and work with some of the most important players in the vibrant crypto ecosystem</li><li>Work on and with state of the art protocols that lay the foundation for an open, transparent, and programmable financial system</li></ul>",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [
					"blockchain"
				],
				"source": "Cryptocurrencyjobs"
			},
			{
				"id": "MAdolgQ",
				"role": "Senior Ecosystem Growth Manager",
				"company_name": "Ripple",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": "Singapore, Singapore",
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/29cf3e97dc6e4e4f4f66d919025965bef2ff29f7.jpg",
				"url": "https://findwork.dev/MAdolgQ/senior-ecosystem-growth-manager-at-ripple",
				"text": "Ripple is looking to hire a Senior Ecosystem Growth Manager to join their team. This is a full-time position that is based in Singapore.",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [],
				"source": "Cryptocurrencyjobs"
			},
			{
				"id": "nvD1vLM",
				"role": "Senior Associate, Advanced Trading & International Exchange",
				"company_name": "Coinbase",
				"company_num_employees": "251-500",
				"employment_type": "full time",
				"location": "London, United Kingdom",
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/92fc80a1d7a4d84514538ce6749609fe9c1b7b12.jpg",
				"url": "https://findwork.dev/nvD1vLM/senior-associate-advanced-trading-international-exchange-at-coinbase",
				"text": "Coinbase is looking to hire a Senior Associate, Advanced Trading & International Exchange to join their team. This is a full-time position that is based in London.",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [],
				"source": "Cryptocurrencyjobs"
			},
			{
				"id": "XlLV3EX",
				"role": "Research Engineering Internship (Formal Methods)",
				"company_name": "SupraOracles",
				"company_num_employees": null,
				"employment_type": null,
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/baa0b3e0e1cb04ca1325973a4e31f8e120777b8d.jpg",
				"url": "https://findwork.dev/XlLV3EX/research-engineering-internship-formal-methods-at-supraoracles",
				"text": "SupraOracles is looking to hire a Research Engineering Internship (Formal Methods) to join their team. This is an internship position that is 100% remote with no geographical restrictions. Work remotely from anywhere.",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [],
				"source": "Cryptocurrencyjobs"
			},
			{
				"id": "MNN73LM",
				"role": "Director, Talent Development",
				"company_name": "Fireblocks",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": "New York, United States",
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/a7ef3e7536f20b92c1ef5d5412ce3fa486c3f323.jpg",
				"url": "https://findwork.dev/MNN73LM/director-talent-development-at-fireblocks",
				"text": "Fireblocks is looking to hire a Director, Talent Development to join their team. This is a full-time position that is based in New York NY.",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [],
				"source": "Cryptocurrencyjobs"
			},
			{
				"id": "QGpqldM",
				"role": "Sales Development Representative",
				"company_name": "Liquify",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/18d5cd8d8ca0cbc710d3ddeae62da8f6e8028417.jpg",
				"url": "https://findwork.dev/QGpqldM/sales-development-representative-at-liquify",
				"text": "<p>For <a>Liquify</a> I’m looking for a <strong>proactive</strong> Sales Development Representative (SDR) with a knowledge of crypto & decentralized tech!</p><p>Be a vital part of an OG team, driving growth and revenue in an exciting tech space!</p><h2>We’re looking for:</h2><ul><li>Strong crypto and decentralized tech knowledge.</li><li>Proven <strong>SDR experience</strong> with outstanding results.</li><li>Hungry for success!</li><li>Exceptional communication and problem-solving skills.</li><li>Independent, team-oriented, success-driven attitude.</li></ul><h2>Benefits:</h2><ul><li>Competitive salary + commission</li><li>Career growth opportunities (<strong>you’ll be learning from OGs and developing a stellar network</strong>).</li><li>Dynamic, supportive environment.</li></ul><h2>Interested and ready to make an impact?</h2><p>Apply now: Send your CV to   <a>robert@liquify.io</a>.</p><h2>More About Liquify</h2><p>Infrastructure as a Service (IaaS)</p><p>For institutional investors, foundations, and Web3 builders - grow your assets, communities, and revenue knowing your blockchain infrastructure is in the hands of experts.</p><ul><li><a>Liquify</a> ecosystem chains supported.</li></ul><p><strong>Bare metal</strong> Infrastructure as a Service</p><ul><li>Nodes</li><li>Validators</li><li>RPC endpoints</li><li>Snapshots</li><li>SubGraphs</li><li>Monitoring solutions and other custom tools.</li></ul><p>Currently supporting <strong>60+ chains</strong> with over 1 billion RPC calls daily and <strong>$300M million AUM.</strong></p><p>High uptime (99.95% guaranteed) as well as optimized throughput, latency, decentralization. Tier 3 and 4 data-centers span across Asia, US East and West, and Europe.</p>",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [
					"blockchain",
					"web3"
				],
				"source": "Cryptocurrencyjobs"
			},
			{
				"id": "Xxq6a0n",
				"role": "Growth Marketing Specialist",
				"company_name": "token.com",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/4b68e529a1ca712c2d75a024522571e1bfd28f13.jpg",
				"url": "https://findwork.dev/Xxq6a0n/growth-marketing-specialist-at-tokencom",
				"text": "<p>Hi, we’re token.com. Our goal is to create a world where money can flow effortlessly into the things people truly care about. token.com is the fun, simple, and social platform to discover and invest in the game-changing ventures of tomorrow. At token.com we recognise the positive value of diversity, we promote equality and challenge discrimination. We actively encourage job applications from people of all backgrounds.</p><p>We’re a high-performance team of around 65 people. We have freedom and responsibility, a culture that encourages innovation, offers ownership and embraces knowledge sharing. We are now working as a team first, remote friendly company, arranging monthly get-togethers and regular team retreats. We also have a co-working space in London for collaboration and socialising.</p><p>We are looking for a driven and creative Growth Marketing Specialist to join our Marketing team.</p><p>To help you best prepare, we’ve outlined the interview process for this role, we aim to have this process completed within 3 weeks:</p><ul><li>30 minute Google Meet with our People and Talent Coordinator</li><li>60 minutes Google Meet with our Head of Growth</li><li>60 minutes case study presentation</li><li>Final 1 hour Google Meet with our VP of Marketing</li></ul><h2>About you:</h2><p>What we’re looking for:</p><ul><li>5+ years of experience driving growth for companies with paid and organic strategies</li><li>2+ years of experience working with mobile app growth.</li><li>Proficient in ASO and SEO for organic channel growth.</li><li>Analytical Skills: Proficient in data analysis tools (Spreadsheets, SQL) and platforms (Looker, Amplitude, AppsFlyer, GA4).</li><li>Results-Driven: You consistently surpass marketing goals, prioritising measurable outcomes and ROI.</li><li>Analytical Skills: You adeptly utilise data tools and platforms for informed decision-making.</li><li>Innovative Thinking: Your creativity shines in crafting unique marketing strategies.</li><li>Adaptability: You swiftly adjust strategies in response to changing environments.</li><li>Communication Skills: You excel in conveying complex ideas clearly and succinctly.</li><li>You are fluent in English</li><li>Web 3 and/or crypto Industry knowledge</li></ul><h2>What you’ll be doing:</h2><ul><li>Develop and execute a comprehensive performance marketing strategy for user acquisition, engagement, and retention.</li><li>Plan, brief, implement, and optimise digital marketing campaigns across paid social, SEM, Display, and affiliate networks.</li><li>Effectively manage the performance marketing budget.</li><li>Utilise analytics tools (AppsFlyer, Amplitude, GA4) to track, analyse, and report on campaign performance.</li><li>Present regular reports to stakeholders with key metrics and achievements.</li><li>Collaborate with CRM, product, design, and engineering teams to align marketing efforts with the product roadmap.</li><li>Ensure consistent messaging and branding across all channels.</li><li>Implement A/B testing to optimise ad creatives, website conversion rates, landing pages, and other campaign elements.</li><li>Identify improvement opportunities based on performance data.</li><li>Develop and implement user segmentation strategies for personalised marketing.</li><li>Collaborate with data analytics teams for targeted campaigns.</li><li>Oversee organic initiatives, including SEO and ASO, working with freelancers and agencies to boost organic channels.</li></ul><p><strong>Please note that we are not in the position to offer sponsorship for this role.</strong></p>",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [
					"sql",
					"seo"
				],
				"source": "Cryptocurrencyjobs"
			}
		]
	},
	{
		"count": 15,
		"next": "https://663d7041e1913c476794463b.mockapi.io/jobs?page=3&limit=1",
		"previous": "https://663d7041e1913c476794463b.mockapi.io/jobs?page=2&limit=1",
		"results": [
			{
				"id": "M1pr82Q",
				"role": "Praktikum bei grünem FinTech // Bees &amp; Bears",
				"company_name": "Bees &amp; Bears",
				"company_num_employees": null,
				"employment_type": null,
				"location": "Berlin, Germany",
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/9db349a126ae1505a69c259863d9cd4bfd556bc5.jpg",
				"url": "https://findwork.dev/M1pr82Q/praktikum-bei-grunem-fintech-bees-amp-bears-at-bees-amp-bears",
				"text": "Du möchtest in einem visionären Unternehmen und einem dynamischen, auf Impact ausgerichteten Start-up-Umfeld wertvolle Erfahrungen sammeln? Du suchst einen außergewöhnlichen Arbeitsplatz mit steiler Lernkurve und echtem Einfluss auf die nachhaltige Transformation der Gesellschaft? Dann werde als Praktikant Teil unseres starken Teams!\n\n<strong>Aufgaben</strong>\n\nFür unser dynamisches Team suchen wir einen motivierten Praktikanten, der uns bei Themen im Business Development, Produktmanagement, Finanzierung und im allgemeinen operativen Geschäft unterstützt. Deine Aufgaben umfassen Recherche und Reporting, Datenanalyse zur Unterstützung von Entscheidungsprozessen sowie kritisches Denken und strategische Impulse. Du wirst außerdem Spreadsheets pflegen und erstellen, Konzepte entwickeln, Meetings auswerten und Berichte erstellen.\n\nAls Teil des Teams wirst du voll integriert sein, Verantwortung übernehmen, mit dem Team wachsen und lernen sowie wichtige Impulse einbringen, ohne dich vor komplexen Gedankengängen zu scheuen.\n\n<strong>Dein Profil:</strong>\n<ul>\n \t<li>Du bist hoch motiviert, interessiert und arbeitest gerne im Team.</li>\n \t<li>Du triffst gerne informierte Entscheidungen und recherchierst sorgfältig und effizient.</li>\n \t<li>Du fühlst dich in einem dynamischen, schnell wachsenden Umfeld mit viel Raum für persönliches Wachstum wohl.</li>\n \t<li>Du interessierst dich für Klimaschutz und Nachhaltigkeit und möchtest mehr darüber erfahren und bewirken.</li>\n \t<li>Deutsch beherrschst du auf Muttersprachniveau und Englisch C1 fließend in Wort und Schrift.</li>\n \t<li>Du studierst erfolgreich in einem wirtschafts- oder naturwissenschaftlichen Bereich oder einer anderen relevanten Disziplin.</li>\n \t<li>Du hast ein natürliches Gespür für komplexe Zusammenhänge und verfügst über sehr gute Kommunikationsfähigkeiten.</li>\n \t<li>Auch wenn du nicht alle Kriterien erfüllst, aber für die Aufgabe brennst, ist das kein Ausschlusskriterium.</li>\n \t<li>Du bist versiert in Excel und PowerPoint, kannst Recherchen durchführen und Meetings leiten sowie dich problemlos in neue Aufgabenbereiche einarbeiten.</li>\n \t<li>Du bist zuverlässig, sehr gut organisiert, pragmatisch und unternehmerisch.</li>\n</ul>\n<strong>Benefits</strong>\n<ul>\n \t<li>Bei uns darfst du dich ausprobieren und wirst in alle Bereiche eingeführt.</li>\n \t<li>Tagsüber verändern wir die Welt und haben Spaß dabei. Regelmäßige Team-Events und auch mal ein Bier oder Mate nach der Arbeit.</li>\n \t<li>Arbeite in Deutschlands bestem Startup und einem angehenden \"grünen\" Unicorn und gestalte aktiv die Transformation mit.</li>\n \t<li>Lerne täglich über die neuesten Klima-Technologien und arbeite mit innovativsten Hardware-Unternehmen im ClimateTech-Bereich zusammen.</li>\n \t<li>Arbeite Seite an Seite mit unseren erfahrenen Gründern Marius (3-facher Gründer) und Jakob (2-facher Gründer) – die perfekte Vorbereitung, falls du selbst gründen möchtest.</li>\n \t<li>Unbegrenzte Urlaubstage für Aktivismus und Demos.</li>\n</ul>\nAls grünes FinTech sind wir bei Bees & Bears davon überzeugt, dass Kapital der Schlüssel zur Beschleunigung der Energiewende ist. Die Herausforderung, vor der wir stehen, ist gewaltig: Bis 2050 müssen weltweit 150 Billionen Euro (!) investiert werden, um Klimaneutralität zu erreichen. 65% dieser Investitionen müssen durch Kredite finanziert werden.\n\nUnsere Mission ist es, Kapital in die nachhaltige Wirtschaft zu lenken, um die Transformation zu beschleunigen und die Welt grüner zu gestalten. Dabei arbeiten wir eng mit den Herstellern und Verkäufern von grüner Hardware wie Energiespeichern, Solaranlagen und Wärmepumpen zusammen, damit ihre Kunden die Anlagen und Maschinen so einfach wie ein Telefon über Klarna finanzieren können.\n\nHierbei handelt es sich um ein bezahltes Praktikum, ab sofort!\n\nUnsere Gründer:\n\nJakob von Egidy\n\nMarius Schondelmaier",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [
					"fintech"
				],
				"source": "Berlinstartupjobs"
			},
			{
				"id": "MLrVmmn",
				"role": "Senior Business Development (w/m/d) // esc &#8211; energy smart control GmbH",
				"company_name": "esc - energy smart control GmbH",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": "Berlin, Germany",
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/322f929feab1daf92c00956fe878c308305b8bcb.jpg",
				"url": "https://findwork.dev/MLrVmmn/senior-business-development-wmd-esc-8211-energy-smart-control-gmbh-at-esc-energy-smart-control-gmbh",
				"text": "Einsatzort: Berlin, Deutschland • Vollzeit, Festanstellung • Vergütung: 65.000 - 75.000 EUR/Jahr\n\nDie Energiewende benötigt Lösungen um Energie möglichst effektiv und effizient zu nutzen.\n\nUnser Team in Berlin konzipiert und entwickelt nutzerorientierte digitale Produkte für die Energie der Zukunft. IOmeter ist unsere Smart Meter IoT Lösung für Stromkunden- und Versorger, welches den Stromverbrauch von privaten Haushalten sichtbar macht.\n\nTransparenz schafft Effizienz und reduziert so den Energieverbrauch. So helfen wir, die Umwelt zu schützen, zum Gelingen der Energiewende beizutragen - und Kosten zu sparen.\nMit unserem Ökosystem verknüpfen wir Verbraucher, Energieversorger und spannende neue Player im Bereich dynamische Tarife, Energy Trading und Visualisierung.\nFür den weiteren Ausbau des Vertriebs suchen wir einen unternehmerisch denkenden, selbständig arbeitenden Teamplayer mit exzellenten Sales- und Marketingfähigkeiten und ersten Erfahrungen im Aus- und Aufbau von neuen Geschäftseinheiten.\n\n<strong>Aufgaben:</strong>\n<ul>\n \t<li>Umsetzung der Vertriebsstrategie im Bereich der Energieversorger</li>\n \t<li>Akquisition und Entwicklung von weiteren strategischen Vertriebspartnerschaften</li>\n \t<li>Festigung und Weiterentwicklung der Kundenbeziehungen und damit Sicherstellung eines profitablen Wachstums des Unternehmens</li>\n \t<li>Akquisition definierter Adressen sowie eigenverantwortliche Betreuung bestehender Geschäftspartner</li>\n \t<li>Analyse und Aufnahme des Kundenbedarfs, Angebotserstellung und Nachverfolgung</li>\n \t<li>Vorbereitung und Durchführung von Vertragsverhandlungen</li>\n \t<li>Verwaltung und Pflege der Daten und Aktivitäten im CRM</li>\n \t<li>Teilnahme an Messen und Verantwortung für Kundenevents</li>\n \t<li>Entwicklung und Umsetzung einer ganzheitlichen Webinar-Strategie</li>\n</ul>\n<strong>Profil:</strong>\n<ul>\n \t<li>Vertrieblich geprägte, initiative Persönlichkeit optimalerweise mit Erfahrung in der Energiewirtschaft</li>\n \t<li>Fähigkeit, Marktsignale analytisch auszuwerten und die Ergebnisse direkt in die Akquisition umzusetzen</li>\n \t<li>Nachweisbare Erfolge in der Akquisition und verkaufsfördernden Betreuung</li>\n \t<li>Überzeugende didaktische Fähigkeiten sowie die Fähigkeit, komplexe Sachverhalte\nklar und präzise darzustellen</li>\n</ul>\nWir freuen uns auf Deine Bewerbung.\n\nKontakt:\njobs@energy-smart-control.de",
				"date_posted": "2024-05-03T04:00:00Z",
				"keywords": [],
				"source": "Berlinstartupjobs"
			},
			{
				"id": "Q03aqYn",
				"role": "Sr. BE Engineer",
				"company_name": "Mark43",
				"company_num_employees": "101-250",
				"employment_type": null,
				"location": "USA or Canadian Candidates\nStaff Engineer (Backend)",
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/Mark43",
				"url": "https://findwork.dev/Q03aqYn/sr-be-engineer-at-mark43",
				"text": "Mark43 builds mission critical software for Public Safety agencies. We provide cities like Boston, Seattle and Atlanta with software that allows them to dispatch first responders and capture critical data.<br>Our stack is Java, React, Typescript, Mysql, Kubernetes and AWS.<br>Find out more and apply at: <a href=\"https:&#x2F;&#x2F;mark43.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;mark43.com&#x2F;careers&#x2F;</a> Email jon (dot)dauch (at)mark43.com if interested",
				"date_posted": "2024-05-02T23:43:55Z",
				"keywords": [
					"react",
					"aws",
					"kubernetes",
					"typescript",
					"mysql"
				],
				"source": "Hn"
			},
			{
				"id": "XO9EKJQ",
				"role": "Sr. SDR",
				"company_name": "HockeyStack",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/142062e38550de15d6025e9cbe3bdcf0d9cf29dd.jpg",
				"url": "https://findwork.dev/XO9EKJQ/sr-sdr-at-hockeystack",
				"text": "<p>We’re hiring a founding SDR:</p>\n<p>Here’s why, what we’re looking for, and why you should join.</p>\n<p>Why we’re hiring an SDR: We went from 0 to 7 figures in a year 100% inbound, our first rep hit quota in 8 months, and we haven’t even scratched the surface of exploring outbound. We are constantly getting leads from content, our interactive demo and first-party intent signals from within our own platform, and have no bandwidth to follow up with them.</p>\n<p>We have a strong brand, the best product in our category, and a great team.</p>\n<p>This is an SDR dream and one of the best problems we could have. We are scaling the sales team and we are leaving a ton of money on the table by only focusing on our inbound demand.</p>\n<p>What we’re looking for: An experienced SDR who wants to do big things but is underappreciated at their current org, has no growth potential or feels limited by acting like a robot sending sequences that someone else created. Someone who knows or can learn new technology like Clay and others to scale their output to that of multiple reps. Top SDR at their current org.</p>\n<p>In SF (in office 5 days /week). MarTech and Early Stage experience are ideal.</p>\n<p>Why you should join: A ton of warm leads, complete greenspace for outbound, opportunity to build a process from scratch and grow into a leadership role (or AE), and join one of the fastest growing startups in the Bay.</p>\n<p>Comp: 80/40 + equity</p>\n",
				"date_posted": "2024-05-02T22:06:53Z",
				"keywords": [],
				"source": "Ycombinator"
			},
			{
				"id": "nJR0Pln",
				"role": "Dynamic Graphic Designer",
				"company_name": "day3 media",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/nJR0Pln/dynamic-graphic-designer-at-day3-media",
				"text": "<h1>We're a young marketing agency experiencing rapid growth beyond our initial projections, focusing primarily on brand design and strategy.</h1><p></p><p>We're on the lookout for dynamic, imaginative, and high-energy individuals who express themselves through their art, possess a keen eye for detail, and are eager to cultivate their skills further.</p><p></p><p>What is the role of a graphic designer? The graphic designer job description includes the entire process of defining requirements, visualizing, and coming up with unique concepts. This involves collaborating with team members, transforming concepts into visual representations, and ultimately crafting designs that captivate audiences.</p><p></p><p>Skill sets should include </p><p>- Proven graphic designing experience ( UI/UX a plus)</p><p>- Ability to work methodically and meet deadlines</p><p>- Robust understanding of and ability to work within our brand guidelines and voice, ensuring consistency and alignment across all communication and creative outputs.</p><p>- Ability to stay current with social media trends and bring new ideas to the table.</p><p>- Solid grasp of design principles, including color theory, composition, typography, and seasonal design trends.</p><p>- Adobe Photoshop</p><p>- Adobe Illustrator</p><p>- Adobe InDesign</p><p></p><p>What's in it for you? Picture yourself as a pivotal player in our creative orchestra, where every note and every stroke of genius contributes to our symphony of success. Gear up for fun and exciting tasks! You'll be an integral part of our creative ensemble, where every voice matters in shaping our projects for maximum impact. Expect a diverse array of daily tasks spanning logo design, brand design, packaging, print, typography, product design, flyers, brochures, brand guides, business cards, posters, and much more!</p><p></p><p>If you're ready to unleash your artistic flair and be part of a collaborative, forward-thinking environment, then we want to hear from you! </p><p></p><p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSepsBvkhtC0tZCYCGrQxuJvBfKM7EOH4kmTJHzJqqXu1U9kzA/viewform?usp=sf_link\" rel=\"nofollow noreferrer\">https://docs.google.com/forms/d/e/1FAIpQLSepsBvkhtC0tZCYCGrQxuJvBfKM7EOH4kmTJHzJqqXu1U9kzA/viewform?usp=sf_link</a></p>",
				"date_posted": "2024-05-02T21:26:58Z",
				"keywords": [
					"illustrator",
					"express",
					"indesign",
					"photoshop",
					"ux"
				],
				"source": "Dribbble"
			},
			{
				"id": "XRLKezQ",
				"role": "Go-To-Market (GTM) Specialist",
				"company_name": "OpenMeter",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/b43f636a4fdbcd26ded37a4e3044e2e599f75c28.jpg",
				"url": "https://findwork.dev/XRLKezQ/go-to-market-gtm-specialist-at-openmeter",
				"text": "<p>We are looking for a driven Go-To-Market (GTM) Specialist to own the end-to-end customer lifecycle from prospecting to closing deals and onboarding customers. This hybrid role blends sales, marketing, and customer success elements, offering an exciting opportunity to make a significant impact. </p>\n<p>In this role, you will collaborate closely with the founders to develop and execute strategies to enable the company to reach PMF faster.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Collaborate closely with our CEO on the entire GTM strategy</li>\n<li>Establish an outbound sales strategy</li>\n<li>Identify potential leads and build the sales pipeline</li>\n<li>Collaborate with cross-functional stakeholders to break into new accounts</li>\n<li>Book discovery meetings and gather information for future opportunities.</li>\n<li>Work with the product team to establish the foundations of a good PLS motion</li>\n<li>Create and document internal processes for the next sales hires</li>\n<li>Evolve the toolset to support your newly defined processes</li>\n<li>Accurate tracking of interactions and customer information in CRM</li>\n<li>Maintain a professional social presence in line with the company's content marketing strategy to build awareness and trust with personas at ICP companies.</li>\n</ul>\n<h3>Minimum Requirements</h3>\n<ul>\n<li>You have 3+ years of sales or GTM experience in enterprise software</li>\n<li>You are a native English speaker or bilingual</li>\n<li>You have startup experience and an entrepreneurial mindset</li>\n<li>You thrive in a fast-paced environment and can adapt to changing priorities.</li>\n<li>You understand corporate structures and decision-making processes</li>\n<li>You are proficient in sourcing and managing pipeline through outbound activities</li>\n<li>You have a strong grasp of the sales process and can manage opportunities from prospecting to closed-won.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>You have 5+ years of experience in direct B2B sales</li>\n<li>You have 1+ year of experience working at an early-stage startup (&lt; 3M ARR)</li>\n<li>You have a proven track record of meeting or exceeding sales targets and KPIs.</li>\n<li>You’re familiar with sales tools and CRMs needed to source and close opportunities</li>\n</ul>\n<p>We don't expect you to be an expert in all the areas mentioned. We're keen to connect with you if you're skilled in GTM and passionate about tech products and meet some of these qualifications.</p>\n<h3>Join Us</h3>\n<p>If you're passionate about driving growth, building relationships, and making an impact in a dynamic startup environment, we want to hear from you! Join us in shaping the future of AI monetization and be part of a team pushing innovation's boundaries.</p>\n",
				"date_posted": "2024-05-02T21:10:54Z",
				"keywords": [],
				"source": "Ycombinator"
			},
			{
				"id": "nvD12xM",
				"role": "Founding Account Executive",
				"company_name": "OpenMeter",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": true,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/b43f636a4fdbcd26ded37a4e3044e2e599f75c28.jpg",
				"url": "https://findwork.dev/nvD12xM/founding-account-executive-at-openmeter",
				"text": "<p>We are looking for a driven Founding Account Executive to own the end-to-end customer lifecycle from prospecting to closing deals and onboarding customers. This hybrid role blends sales, marketing, and customer success elements, offering an exciting opportunity to make a significant impact. </p>\n<p>In this role, you will collaborate closely with the founders to develop and execute strategies to enable the company to reach PMF faster.</p>\n<h3>Key Responsibilities</h3>\n<ul>\n<li>Collaborate closely with our CEO on the entire GTM strategy</li>\n<li>Establish an outbound sales strategy</li>\n<li>Identify potential leads and build the sales pipeline</li>\n<li>Collaborate with cross-functional stakeholders to break into new accounts</li>\n<li>Book discovery meetings and gather information for future opportunities.</li>\n<li>Work with the product team to establish the foundations of a good PLS motion</li>\n<li>Create and document internal processes for the next sales hires</li>\n<li>Evolve the toolset to support your newly defined processes</li>\n<li>Accurate tracking of interactions and customer information in CRM</li>\n<li>Maintain a professional social presence in line with the company's content marketing strategy to build awareness and trust with personas at ICP companies.</li>\n</ul>\n<h3>Minimum Requirements</h3>\n<ul>\n<li>You have 3+ years of sales or GTM experience in enterprise software</li>\n<li>You are a native English speaker or bilingual</li>\n<li>You have startup experience and an entrepreneurial mindset</li>\n<li>You thrive in a fast-paced environment and can adapt to changing priorities.</li>\n<li>You understand corporate structures and decision-making processes</li>\n<li>You are proficient in sourcing and managing pipeline through outbound activities</li>\n<li>You have a strong grasp of the sales process and can manage opportunities from prospecting to closed-won.</li>\n</ul>\n<h3>Preferred Qualifications</h3>\n<ul>\n<li>You have 5+ years of experience in direct B2B sales</li>\n<li>You have 1+ year of experience working at an early-stage startup (&lt; 3M ARR)</li>\n<li>You have a proven track record of meeting or exceeding sales targets and KPIs.</li>\n<li>You’re familiar with sales tools and CRMs needed to source and close opportunities</li>\n</ul>\n<p>We don't expect you to be an expert in all the areas mentioned. We're keen to connect with you if you're skilled in GTM and passionate about tech products and meet some of these qualifications.</p>\n<h3>Join Us</h3>\n<p>If you're passionate about driving growth, building relationships, and making an impact in a dynamic startup environment, we want to hear from you! Join us in shaping the future of AI monetization and be part of a team pushing innovation's boundaries.</p>\n",
				"date_posted": "2024-05-02T21:10:54Z",
				"keywords": [],
				"source": "Ycombinator"
			},
			{
				"id": "XO9EZxQ",
				"role": "Backend Applications Engineer",
				"company_name": "Ai-RGUS",
				"company_num_employees": null,
				"employment_type": null,
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/XO9EZxQ/backend-applications-engineer-at-ai-rgus",
				"text": "Ai-RGUS is artificial intelligence 100%-software solution that makes security camera system maintenance easy. Initially developed to manage Duke University’s 2000+ camera system and now deployed in all 50 US states, Canada, and abroad, it automatically alerts of any problems, including cameras down&#x2F;unclear views, and cybersecurity vulnerabilities and automatically alerts the security team otherwise. We have an online user interface and API, making our software user-friendly and hassle-free.<br>We are looking for a Backend Applications Engineer to integrate our software with more security camera systems, help maintain our existing integrations, develop new functionality and expand the scope and functionality of our data collection and alerting engine for the large amounts of data we collect on a daily basis from security camera systems big and small.<br>We are looking for someone with 3+ years of industry experience with Python who can own the code they write, who is familiar with working on a team, code-reviews, and generally secure coding practices.<br><a href=\"https:&#x2F;&#x2F;ai-rgus.com\" rel=\"nofollow\">https:&#x2F;&#x2F;ai-rgus.com</a><br>Remote position, health insurance offered, no visa-sponsorship available.",
				"date_posted": "2024-05-02T21:00:59Z",
				"keywords": [
					"python"
				],
				"source": "Hn"
			},
			{
				"id": "Q03a2Yn",
				"role": "Senior/Lead Fullstack Engineer; Fullstack Engineer",
				"company_name": "Polysentry",
				"company_num_employees": null,
				"employment_type": null,
				"location": "US Citizens Only",
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/Q03a2Yn/seniorlead-fullstack-engineer-fullstack-engineer-at-polysentry",
				"text": "Polysentry is a technology company that provides industry leading data discovery, classification and analysis solutions. Founded in San Francisco, CA in 2018, Polysentry has been building and deploying mission-ready AI-based platforms that meet rapidly evolving security needs. The company’s software solutions are built for corporate and government organizations.<br>We&#x27;re hiring two technical roles that will have a significant impact on the future architecture of our core product.<br>1) Senior&#x2F;Lead Fullstack Engineer <a href=\"https:&#x2F;&#x2F;www.polysentry.com&#x2F;careers&#x2F;senior-lead-fullstack-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.polysentry.com&#x2F;careers&#x2F;senior-lead-fullstack-dev...</a><br>2) Fullstack Engineer <a href=\"https:&#x2F;&#x2F;www.polysentry.com&#x2F;careers&#x2F;fullstack-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.polysentry.com&#x2F;careers&#x2F;fullstack-developer</a><br>These positions will play an instrumental role in building a real time intelligence platform to best in class. You will have the opportunity to work in a small, agile team developing features across the entire product journey, contributing to idea generation, design, prototyping, and the delivery of production-ready solutions.<br>Think you are a good fit? Submit your resume for the position today! jobs at polysentry dot com",
				"date_posted": "2024-05-02T20:50:21Z",
				"keywords": [],
				"source": "Hn"
			},
			{
				"id": "ny5pq0n",
				"role": "Staff Product Designer",
				"company_name": "Whop",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/ny5pq0n/staff-product-designer-at-whop",
				"text": "<h2>About Whop</h2><p>Whop is on a mission to create a new paradigm of the internet – where connection, consumption, creation and commerce can happen all in one place. People come to Whop every month, from nearly every country, to learn new things, meet new people, and elevate their daily lives.</p><p>Less than 3 years into our existence, we have enabled tens of thousands of creators to earn nearly $315M by selling access to increasingly diverse digital offerings. Our apps infrastructure allows anyone to build a digital experience, and our marketplace offers creators a sleek storefront that can accept payments, seamlessly deliver digital products, and attract new customers.</p><p>We envision a future in which everyone is an internet entrepreneur. Join us in making that future a reality.</p><h2>Quick benefits overview</h2><p>✅ Target base salary of $180,000 - $250,000 depending on experience + a competitive equity package </p><p>❤️ Unlimited PTO, Health, Vision, and Dental coverage </p><p>📍 Brooklyn, New York | Check out our office <a href=\"https://www.tengrandstreet.com/\" rel=\"nofollow noreferrer\">here</a> and <a href=\"https://www.therefineryatdomino.com/\" rel=\"nofollow noreferrer\">here </a></p><p>🥙 Daily $20 lunch, $25 dinner Uber Eats credits </p><p>💪 State of the art gym access @ <a href=\"https://www.equinox.com/\" rel=\"nofollow noreferrer\">Equinox </a></p><p>💻 Latest 14 or 16 inch Macbook Pro</p><h2>More about the Role</h2><p>Reporting directly to our CEO/CPO, you'll be a strategic product leader who can also execute quickly in our fast-paced environment. We need someone with experience building and scaling engaging web and mobile products for consumers. You must have experience driving user retention and engagement through outstanding product experiences.</p><p>As a Lead Product Manager for our User Growth and Engagement teams, you will own the end-to-end user experience across our platforms and offerings. You will deeply understand our users' needs, behaviors, and pain points through qualitative and quantitative research. Using this knowledge, you will define the product strategy, roadmap, and requirements that deliver outstanding user experiences. You will work cross-functionally with engineering, design, marketing, and other teams to ensure successful execution against an ambitious roadmap.</p><p>You will leverage data to make decisions, prioritize initiatives, and measure success. Strong analytical skills and the ability to derive insights from metrics are essential. You must be able to deeply listen to users so as to clearly communicate product rationale, break down complex problems, and earn stakeholder alignment. Experience in product management for consumer tech products, particularly marketplaces, is highly desired. You should have a track record of delivering user-centric products that meet business goals and have the battle scars to show for it.</p><h2>Key Responsibilities</h2><ul><li><p>You understand Whop’s strategic position and bring that to life by creating experiences that promote the ecosystem</p></li><li><p>Connect, understand and empathize deeply with our users. You get them and their and pain points from a qualitative and quantitative perspective and constantly thrive to improve their experience</p></li><li><p>You collaborate with the team to set an ambitious product vision for your area, including team goals, success metrics, and long term roadmap</p></li><li><p>We are growing quickly and learning new things every day, be ready to update and adjust on an ongoing basis</p></li><li><p>You drive the formation of Whop’s product culture: Be kind, be curious, be building, be nailing it</p></li><li><p>You do whatever it takes to make sure the team executes well</p></li><li><p>You lead a culture of accountability and delivery of business results</p></li><li><p>You move from ambiguity into clarity and bring everyone along with you on that ride</p></li></ul><h2>Requirements</h2><ul><li><p>5+ years in product management experience with significant time spent leading consumer facing products or working within the digital creator space</p></li><li><p>Natural leadership and ability to make things happen and quickly, deep ownership mentality</p></li><li><p>Strong communication skills and intuition for communication strategy at every level -- within teams, within the company, to users and creators</p></li><li><p>Ability to conceptualize, prioritize and lead multiple projects for stakeholders</p></li><li><p>Detail oriented with superior organizational skills -- balancing multiple projects, deadlines, and requests should be second nature to you</p></li><li><p>Strong critical thinking, and problem-solving skills</p></li><li><p>Strong analytical skills. You are able to work with data to quickly gain insights, build concise reports, and ultimately communicate those insights to a variety of audiences</p><p></p></li></ul>",
				"date_posted": "2024-05-02T20:18:28Z",
				"keywords": [
					"coverage"
				],
				"source": "Dribbble"
			},
			{
				"id": "Qg6qZOn",
				"role": "Senior Full-stack Engineer, DevOps Engineer, QA Engineer, DBA",
				"company_name": "Digital Onboarding",
				"company_num_employees": null,
				"employment_type": null,
				"location": "REMOTE (US based)",
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/Digital-Onboarding",
				"url": "https://findwork.dev/Qg6qZOn/senior-full-stack-engineer-devops-engineer-qa-engineer-dba-at-digital-onboarding",
				"text": "Digital Onboarding is a marketing automation platform that helps banks and credit unions modernize their onboarding process and develop mutually beneficial, profitable relationships with their customers and members.<br><a href=\"https:&#x2F;&#x2F;www.digitalonboarding.com&#x2F;about-us&#x2F;job-openings&#x2F;senior-full-stack-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.digitalonboarding.com&#x2F;about-us&#x2F;job-openings&#x2F;seni...</a><br><a href=\"https:&#x2F;&#x2F;www.digitalonboarding.com&#x2F;about-us&#x2F;job-openings&#x2F;devops-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.digitalonboarding.com&#x2F;about-us&#x2F;job-openings&#x2F;devo...</a><br><a href=\"https:&#x2F;&#x2F;www.digitalonboarding.com&#x2F;about-us&#x2F;job-openings&#x2F;database-administrator-dba\" rel=\"nofollow\">https:&#x2F;&#x2F;www.digitalonboarding.com&#x2F;about-us&#x2F;job-openings&#x2F;data...</a><br>Stack: Elixir + Phoenix, React, Postgres",
				"date_posted": "2024-05-02T19:17:59Z",
				"keywords": [
					"react",
					"phoenix",
					"elixir",
					"postgres"
				],
				"source": "Hn"
			},
			{
				"id": "QV51x6n",
				"role": "STORE DESIGN MANAGER, ARCHITECTURE & PLANNING",
				"company_name": "Sweetgreen",
				"company_num_employees": "1001-5000",
				"employment_type": null,
				"location": "Los Angeles, CA",
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/Sweetgreen",
				"url": "https://findwork.dev/QV51x6n/store-design-manager-architecture-planning-at-sweetgreen",
				"text": "<h3>Job description</h3>The Store Designer Manager of Architecture & Planning is part of the store design team, responsible for our physical restaurant growth and format expansion. This position will help drive the pipeline of new stores by leading a regional growth strategy as part of our national expansion. This position will also assess new locations for store fit, and work with the real estate, construction, and site development team to craft new projects that hit timeline and financial metrics. This position will report to the Director of Design and will have a high impact on the entire store development cycle. <br><br> <br><br>Core Responsibilities: <br><br>- Lead Design Pipeline for assigned regions, by designing projects personally, managing AOR partners, and working with consultants as needed to achieve company goals. Lead projects from Site assessment to Opening- including layout and concept lock, CD creation and review, permitting, construction administration, and punch. Responsible for hitting development timelines and budget goals. <br>- Assess new locations to ensure compatibility with the current store prototype working with AOR partners across the country regarding site assessments and flagging any potential issues prior to lease signing. <br>- Act as an active contributor on the design team to collaborate on new standards, regional expansion strategies, art programs, and prototype updates as driven from R+D and Ops Innovation teams. <br>- Manage project financial returns by participating in budgeting of new projects, and value engineering initiatives at programmatic and site specific levels. Collaborate with Real Estate, Construction, and Procurement on new site development. <br>- Communicate effectively across all internal stakeholders including real estate, construction, procurement, and operations- as well as external consultants and AOR partners to ensure adherence with company goals. This includes weekly calls and written correspondence on project status. <br>- Problem solve to protect project pipeline goals and to accurately represent sweetgreen’s brand in all new stores based on current prototypes. Finding value engineering solutions to new stores without compromising the brand’s execution. <br>- Develop expertise on store operational needs. This includes work around store refreshes and renovations based on operational needs, by evolving the most cost effective and least disruptive solutions possible. <br><br>About you: <br><br>- 3+ years of experience in architectural design management. <br>- Degree in architecture, interior design, or any related field of study. <br>- Ability to prioritize work based on impact and urgency, to deliver on commitments and drive departmental initiatives and achieve results. Quickly escalates and identifies roadblocks when prioritization is unclear. <br>- Strong experience with construction documentation and shop drawing reviews for constructibility. Experience with permitting and interacting with city reviewers to think creatively, resolve questions and obtain permits. <br>- Construction administration experience, managing multiple projects at once and coordinating with GC teams, landlords, and millwork/kitchen vendors. <br>- Strong oral, written and interpersonal communication skills- able to work with and through others to accomplish project work effectively. <br>- Collaborative: it is critical that this role be collaborative, as you will work daily with the internal design team, your regional development team, and company cross-functional stakeholders in operations, technology, culinary, and brand. <br>- Customer-obsessed mindset, realizing that our customer is two fold: our internal team members and operations stakeholders as well as our external customers who engage with the brand through our restaurant locations. <br>- Expert in AutoCAD, Revit, SketchUp and Adobe Creative Suite. <br>- Excellent presentation skills to solicit feedback and approvals. <br><br>Preferred Qualifications: <br><br>- 5+ years of experience in retail or hospitality design for a national brand. <br>- Graduate degree in architecture with path for licensure. <br>- In depth understanding of kitchen equipment and engineering requirements. <br>- Experience managing consultants and vendor relationships.<br> <br><br>What you'll get:<br>- Highly competitive pay + bonus plan<br>- Three different medical plans to suit your and your family's needs<br>- Dental and Vision insurance<br>- Flexible PTO plan<br>- 401k program<br>- Employee HSA and FSA<br>- Complimentary greens<br>- An opportunity to make a real impact on the people around you, both by growing them and by connecting them to real food<br>- To live the sweetlife and celebrate your passion + purpose<br>- A collaborative team of people who live our core values and have your back<br>- A clear career path with opportunities for development, both personally and professionally<br>- Free sweetgreen swag<br>",
				"date_posted": "2024-05-02T18:26:00Z",
				"keywords": [],
				"source": "Coroflot"
			},
			{
				"id": "Mb9RlEQ",
				"role": "Designer II",
				"company_name": "Deckers Outdoor Corporation",
				"company_num_employees": null,
				"employment_type": null,
				"location": "Goleta, CA",
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/Mb9RlEQ/designer-ii-at-deckers-outdoor-corporation",
				"text": "<h3>Job description</h3>Summary of Duties: Design product that meets category and overall brand creative direction. Develop concepts, sketches, and product ideation for assigned categories against product briefs within deadlines established. Work closely with product and development to choose materials and design products within specific pricing goals. Create artwork for new designs to evaluate styling, color and design combinations. Create cover sketches and technical details for development team to utilize in expediting tech/spec packages. Contribute as needed to seasonal inspiration planning. Collaborate closely with development and product team to design products to meet product briefs at target cost.  Schedule meetings with internal team and external partners and supplies agendas, relevant samples and additional materials. Utilize knowledge of current consumer and market trends and interpret those trends into commercial product. Collaborate with Product and Development coordinator to coordinate on access, ordering and delivery of samples where needed. Responsible for maintaining team samples for easy access to reference and confidentiality.<br><br>Qualifications: Bachelor’s degree or equivalent in Industrial Design or related field and 4 years of experience related to footwear design.<br><br>Applicants must have demonstrated experience with the following: <br><br>creating and presenting compelling mood boards that communicate the vision of upcoming footwear collections; developing concepts, sketches, and product ideation for assigned categories against product briefs within the deadlines established; working with product development to choose materials and design products within specific pricing goals; collaborating with development, product line management and material teams to design products to meet product briefs at target cost; construction techniques, outsole construction, last making; manufacturing process from sketch, to teck pack, to prototype, to samples and commercialization; creating technical footwear tech packs on Adobe Illustrator within a 1 to 2 week timeframe turnaround; outsole tooling design, including ideation, tech pack creation and blueprint corrections; building compelling color and material stories; rendering colored Illustrator merchandising boards to evaluate styling, color, and design combinations; developing big picture storytelling ideas and merchandising across categories; designing and developing innovative material concepts to be used across design categories; current consumer and market trends and interpreting those trends into commercial product; and Adobe Illustrator and Photoshop.  <br><br>SALARY: $110,000 - $120,000/year<br><br>The salary range posted reflects the minimum and maximum target for new hire salaries for this role in our Goleta, CA location. Individual pay will be determined by location and additional factors, including job related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary for your preferred location during the hiring process.<br><br>CONTACT:  If interested please apply online at: www.deckers.com/careers (REF16030). Equal Opportunity Employer - minorities/females/veterans/individuals with disabilities/sexual orientation/gender identity",
				"date_posted": "2024-05-02T18:13:00Z",
				"keywords": [
					"sketch",
					"photoshop",
					"illustrator"
				],
				"source": "Coroflot"
			},
			{
				"id": "nYPpm5X",
				"role": "Sr AI Engineer",
				"company_name": "Stealth",
				"company_num_employees": null,
				"employment_type": null,
				"location": "REMOTE or SF",
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/Stealth",
				"url": "https://findwork.dev/nYPpm5X/sr-ai-engineer-at-stealth",
				"text": "Hey all - we&#x27;re a stealth startup founded by a serial entrepreneur with a successful exit &amp; raised a seed round from top Silicon Valley VCs. We&#x27;re on a mission to fix healthcare staffing shortages with AI.<br>We&#x27;re looking for an AI superbuilder who&#x27;s comfortable getting things done across the whole tech stack, with emphasis on backend. Practical experience with developing AI native apps leveraging ChatGPT, Claude or other LLMs is a must.<br>We&#x27;re open to bringing on a founding engineer, offering significant equity.<br>We use Python, NestJS, React, NextJS, Typescript, Kubernetes, Airflow and advanced machine learning systems.",
				"date_posted": "2024-05-02T17:58:03Z",
				"keywords": [
					"typescript",
					"nestjs",
					"python",
					"kubernetes",
					"react"
				],
				"source": "Hn"
			},
			{
				"id": "n7lLGgQ",
				"role": "Junior Research Software Engineer",
				"company_name": "Tufts CTSI",
				"company_num_employees": null,
				"employment_type": null,
				"location": "Remote, U.S.",
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/n7lLGgQ/junior-research-software-engineer-at-tufts-ctsi",
				"text": "Tufts CTSI (<a href=\"https:&#x2F;&#x2F;www.tuftsctsi.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tuftsctsi.org&#x2F;</a>) is one of 60 NIH CTSA awardees. We are seeking a clinical data analyst &#x2F; RSE to support our investigators with cohort discoveries, chart abstractions, data modeling, visualizations, and other data analysis needed for the preparation and performance of medical research grants. You would also help us grow our OHDSI (<a href=\"https:&#x2F;&#x2F;ohdsi.org\" rel=\"nofollow\">https:&#x2F;&#x2F;ohdsi.org</a>) based research data warehouse (ETL from Epic EHR), work with RedCAP instruments, and automate operational processes. This role requires outstanding verbal and written literacy, a love of healthcare data, coupled with technical competence. We use Julia (esp. <a href=\"https:&#x2F;&#x2F;github.com&#x2F;MechanicalRabbit&#x2F;FunSQL.jl\">https:&#x2F;&#x2F;github.com&#x2F;MechanicalRabbit&#x2F;FunSQL.jl</a>) for our database query work. This job is mostly researcher support and improving our ETLs; software we build&#x2F;use is open source.",
				"date_posted": "2024-05-02T17:10:40Z",
				"keywords": [
					"etl",
					"github"
				],
				"source": "Hn"
			}
		]
	},
	{
		"count": 12,
		"next": null,
		"previous": "https://663d7041e1913c476794463b.mockapi.io/jobs?page=3&limit=1",
		"results": [
			{
				"id": "n5ZWVBQ",
				"role": "Software Engineers (Mid, Senior)",
				"company_name": "Range",
				"company_num_employees": "51-100",
				"employment_type": null,
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/n5ZWVBQ/software-engineers-mid-senior-at-range",
				"text": "Range is a Series A wealth management start-up looking to level-up the financial services industry.<br>It&#x27;s currently a small-but-mighty team of 10 engineers, ~40 people company-wide. Our tech stack is modern. You&#x27;ll learn TypeScript, GraphQL, React, AWS and have opportunities to bring in new-to-the-company technologies &#x2F; open source projects &#x2F; SaaS offerings.<br>There is SO much work to do. Every hour you put in contributes to the goal of building the future of wealth management. (You also get a free Range membership for life!)<br>Range HQ is in Tyson Corners, VA. We support fully remote for senior level positions.<br>If you have any questions, I&#x27;m be happy to set up 30 minutes to chat. (Current Range SWE, ex-Amazon, ex-Coupang, ex-Convoy).<br>More info on career benefits: <a href=\"https:&#x2F;&#x2F;www.range.com&#x2F;public&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.range.com&#x2F;public&#x2F;careers</a><br>Apply for SWE role here: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;range&#x2F;jobs&#x2F;4080833005\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;range&#x2F;jobs&#x2F;4080833005</a>",
				"date_posted": "2024-05-02T16:53:04Z",
				"keywords": [
					"react",
					"typescript",
					"aws",
					"graphql"
				],
				"source": "Hn"
			},
			{
				"id": "nalo3AX",
				"role": "Product Engineer",
				"company_name": "Canopy Connect",
				"company_num_employees": null,
				"employment_type": null,
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/nalo3AX/product-engineer-at-canopy-connect",
				"text": "Canopy Connect is single-click insurance data sharing (like &quot;Plaid for insurance&quot;).<br>We serve over 3,500 companies (and growing rapidly!) including insurance agencies, lenders, insurtechs, fintechs, and insurance carriers to streamline acquiring verified insurance data from consumers and businesses.<br>We&#x27;re hiring Product Engineers. We&#x27;re a small, fully remote team based in the US and Canada. We present the best of both worlds - a nimble startup and small team (low strike price on equity and more ownership&#x2F;impact), yet derisked because of our capital efficiency.<br>More information and apply here: <a href=\"https:&#x2F;&#x2F;www.usecanopy.com&#x2F;company&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.usecanopy.com&#x2F;company&#x2F;careers</a>",
				"date_posted": "2024-05-02T16:36:32Z",
				"keywords": [],
				"source": "Hn"
			},
			{
				"id": "XE5eL6X",
				"role": "Senior/Staff/Principal Frontend Engineer; multiple roles",
				"company_name": "Topologic",
				"company_num_employees": null,
				"employment_type": null,
				"location": "Boston, MA, US; Paris, FR; remote",
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/XE5eL6X/seniorstaffprincipal-frontend-engineer-multiple-roles-at-topologic",
				"text": "Over one third of apparel produced is never sold: Topologic’s mission is to eliminate this disastrous overproduction and waste by producing exactly to demand. To do this, we’re reinventing apparel manufacturing, from CAD&#x2F;CAM software to novel intelligent machines. We are attacking a massive $2T industry, are already generating B2B revenue, and are backed with $10m from leading VCs and CAD insiders. We remain in relative stealth.<br>We are hiring passionate senior&#x2F;staff&#x2F;principal frontend software engineers, especially with interest and experience in design tools, computer graphics, and CAD, as well as web development. Our FE tech stack is TypeScript, React 18 (soon to be 19), Redux, and WebGL 2. We also use Rust via Web Assembly.<br>We are also hiring senior&#x2F;staff&#x2F;principal mechanical engineers as well as a machinist to work on our novel hardware projects. We build up deep domain knowledge about our industry and partners and have representative stakeholders in-house who we collaborate with on a daily basis.<br>We prioritize diversity and inclusion of all varieties. We appreciate our colleagues as unique individuals who all bring valuable perspectives to our work.<br>More details and application here: <a href=\"https:&#x2F;&#x2F;jobs.ashbyhq.com&#x2F;topologic\">https:&#x2F;&#x2F;jobs.ashbyhq.com&#x2F;topologic</a>",
				"date_posted": "2024-05-02T16:19:22Z",
				"keywords": [
					"redux",
					"react",
					"typescript",
					"rust"
				],
				"source": "Hn"
			},
			{
				"id": "MAdo5qQ",
				"role": "Account Executive (San Francisco)",
				"company_name": "Kula",
				"company_num_employees": null,
				"employment_type": "full time",
				"location": null,
				"remote": false,
				"logo": "https://findwork-dev-images.s3.amazonaws.com/full/f3461479aa77fa4f96fab2d7fb66169ec473bb15.jpg",
				"url": "https://findwork.dev/MAdo5qQ/account-executive-san-francisco-at-kula",
				"text": "<h1>👋 Who is Kula and what do we do?</h1>\n<p>Hey! We're <a href=\"https://www.joinkula.io/\">Kula</a>, the AI sales team for busy professionals. We believe AI will soon replace human salespeople, and we're working hard to build that future.</p>\n<p>Our growth rate has rocketed up (reach out for specific numbers). We're now hiring to keep up with demand.</p>\n<p>Kula is being built by a team of MIT, IIT, Cambridge and Oxford grads, backed by some of the best investors in the world, including <a href=\"https://www.ycombinator.com/\">Y Combinator</a>, <a href=\"https://www.joinef.com/\">Entrepreneur First</a>, <a href=\"https://www.acecap.com/\">Acequia Capital</a> and angel investors behind companies like <a href=\"https://siliconangle.com/2020/12/21/digital-contract-management-startup-ironclad-reported-raised-100m/\">Ironclad</a>, <a href=\"https://techcrunch.com/2022/01/05/making-sense-of-opensea-at-a-13b-valuation/\">OpenSea</a> and <a href=\"https://www.finextra.com/newsarticle/37669/stripe-raises-600-million-at-a-95-billion-valuation\">Stripe</a>.</p>\n<h1>🧐 Who exactly are you looking for?</h1>\n<p>Over 150 companies already use Kula, and we’re growing revenue extremely fast. This is a lot of fun but also hard work, and we are looking for someone who will enjoy this environment.</p>\n<h3>You'd be a great fit if you're:</h3>\n<p>🧗 <strong>Ambitious</strong></p>\n<p>You're someone who wants to grow fast in their career and can scale with Kula.</p>\n<p>🧠 <strong>Smart</strong></p>\n<p>You explore new creative ways of doing things, have strong opinions and are willing to change them.</p>\n<p>🎯 <strong>Product Focused</strong></p>\n<p>You love learning about customer problems and want to influence the product roadmap</p>\n<p>📈 <strong>A Learner</strong></p>\n<p>You <strong>don't need decades of experience</strong>, we're looking for people who <strong>love learning fast!</strong></p>\n<h1>🔥 So what will I do?</h1>\n<p>As an Account Executive, you will both run your own pipeline and work directly with our leadership team to improve our processes. You will also be helping to establish our San Francisco office and culture:</p>\n<ul>\n<li>Qualify inbound leads generated for you</li>\n<li>Manage your own pipeline of business (we currently use Hubspot as a CRM)</li>\n<li>Ideate on new sales processes</li>\n<li>Learn from customers and influence Kula’s product roadmap</li>\n</ul>\n<h1>🍪 Why should I join Kula?</h1>\n<p>💵 Top of market commission plan</p>\n<p>🟧 Help a YC backed startup to open their San Francisco office</p>\n<p>📈 Accelerate your career with a fast-growth startup</p>\n<p>👨‍👩‍👧‍👦 Join an incredible team from Microsoft, AutoDesk, Cambridge, Oxford, MIT and IIT</p>\n<p>💡 Influence product roadmap; watch a word-class tech team bring your ideas to life!</p>\n",
				"date_posted": "2024-05-02T15:28:34Z",
				"keywords": [
					"hubspot"
				],
				"source": "Ycombinator"
			},
			{
				"id": "Xq2rYJn",
				"role": "Senior Python Backend Engineer",
				"company_name": "Reef Technologies",
				"company_num_employees": null,
				"employment_type": null,
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/Xq2rYJn/senior-python-backend-engineer-at-reef-technologies",
				"text": "We’re all about the backend! As a fully remote Python software house, we comprise a small, agile team of senior engineers, each with at least five years of experience. We&#x27;re known for delivering stable solutions and always accounting for edge cases, minimizing the need for urgent fixes.<br>- Full Remote Flexibility: Work from anywhere.<br>- Flexible Hours: Pick your own hours, with only ~2 calls per week.<br>- Dynamic Projects: Work with startups globally on projects of your choice.<br>- Influence: Contribute to decisions and influence how we operate.<br>- Project Selection: Only accept projects you&#x27;re interested in.<br>- No managers; thanks to the Sociocracy 3.0 framework, everyone&#x27;s opinion is valued.<br>- Personal assistant for your non-work tasks.<br>- Multicultural environment with a voice for everyone.<br>Who Are We Looking For? Experienced Python engineer with at least 5 years of programming (not necessarily professional), including at least a year with Python. Must have a deep love for Python and the ability to come up with Pythonic solutions to problems.<br>How to Apply: Just go to <a href=\"https:&#x2F;&#x2F;careers.reef.pl&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.reef.pl&#x2F;</a> and see what we’re all about! Do not send us CVs.",
				"date_posted": "2024-05-02T14:53:01Z",
				"keywords": [
					"python"
				],
				"source": "Hn"
			},
			{
				"id": "QV51G6n",
				"role": "Senior Software Engineer",
				"company_name": "JUNIPER",
				"company_num_employees": "51-100",
				"employment_type": null,
				"location": null,
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/QV51G6n/senior-software-engineer-at-juniper",
				"text": "Juniper operates at the messy financial infrastructure for US Healthcare. We&#x27;ve built an automated end-to-end insurance billing system for recurring care, starting with Autism clinics.<br>At Juniper, we’ve built an end-to-end billing system. We’ve built something really good, something that clinicians really need and love. We automate and abstract the tedious, manual, repetitive work that goes into the administrative duties of running a clinic, so that clinicians can do what they do best — providing high quality care. It starts with ingesting clinic data, and then create, validates, and submits claims to insurance providers across the country. If claims need corrections or appeals, most of the time we can handle those automatically or our CX and Operations team use our in-house internal tools. We also handle patient invoicing for co-pays, co-insurance, and deductibles (we never send anything to collections).<br>We are a team of 27 with strong product market fit — in Q4 last year we’ve had to push out onboarding because engineering can’t build quickly enough, something we’ve scaled out of and will hopefully not bottleneck growth again. You’ll be working with an engineering leadership team from AWS and Stripe to get doctors and clinicians back to work helping kids.",
				"date_posted": "2024-05-02T14:04:49Z",
				"keywords": [
					"aws"
				],
				"source": "Hn"
			},
			{
				"id": "Mb9RNEQ",
				"role": "Data Scientist",
				"company_name": "Enveritas",
				"company_num_employees": null,
				"employment_type": null,
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/Mb9RNEQ/data-scientist-at-enveritas",
				"text": "Enveritas is a 501(c)3 non-profit working on sustainability issues facing coffee farmers around the globe. We provide sustainability assurance for the coffee industry. We visit smallholder coffee farms around the world to understand their social, economic, and environmental practices. In 2024, we will visit over 70,000 farms across more than 25 countries in Asia, Africa, and Latin America. We work with leading coffee roasters to understand the sustainability issues in their supply chain based on our sustainability standards.<br>* Backend Software Engineer - $130-$150k — <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;enveritas&#x2F;jobs&#x2F;4006514008\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;enveritas&#x2F;jobs&#x2F;4006514008</a> (worldwide remote)<br>* Data Scientist, Statistics — $110-$130k — <a href=\"https:&#x2F;&#x2F;www.enveritas.org&#x2F;jobs&#x2F;data-scientist&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.enveritas.org&#x2F;jobs&#x2F;data-scientist&#x2F;</a> (worldwide remote)",
				"date_posted": "2024-05-02T14:03:52Z",
				"keywords": [],
				"source": "Hn"
			},
			{
				"id": "XO9EeWQ",
				"role": "Blockchain Infrastructure Engineer",
				"company_name": "ParaFi Technologies",
				"company_num_employees": null,
				"employment_type": null,
				"location": null,
				"remote": true,
				"logo": null,
				"url": "https://findwork.dev/XO9EeWQ/blockchain-infrastructure-engineer-at-parafi-technologies",
				"text": "We&#x27;re a small team of engineers running some of the highest-performing blockchain validators and node infrastructure. Looking for a passionate engineer with ~2-6 YoE who wants to both develop software + infrastructure (Python, Go, Terraform, Docker...), and participate in other parts of the business, from financial modeling to talking with customers. Get the fun of a startup with the stability of an established investment firm!<br>For more info, email [my username with a dot before p]@parafi.tech",
				"date_posted": "2024-05-01T23:34:37Z",
				"keywords": [
					"node",
					"docker",
					"blockchain",
					"terraform",
					"python"
				],
				"source": "Hn"
			},
			{
				"id": "Qg6qpmn",
				"role": "Senior Backend Engineer",
				"company_name": "Arro",
				"company_num_employees": null,
				"employment_type": null,
				"location": "LA OR Remote",
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/Qg6qpmn/senior-backend-engineer-at-arro",
				"text": "Join Arro as we revolutionize access to credit for millions. As part of our engineering team, you&#x27;ll contribute to a platform that combines financial education with innovative lending solutions. Enjoy a competitive salary, equity, remote work flexibility, and a culture focused on learning and growth. Apply now and make a real difference.<br>Arro is looking for a Senior Backend Engineer with 7+ years of experience, proficient in Node, Typescript, JavaScript, and AWS. Ideal candidates are problem solvers with strong CS fundamentals, eager to mentor, and skilled in agile environments. Join us in building fair access to credit. Benefits include competitive salary, equity, and more. No LeetCode at the interview, just a cool set of coding challenges!",
				"date_posted": "2024-05-01T23:20:28Z",
				"keywords": [
					"typescript",
					"aws",
					"node",
					"javascript"
				],
				"source": "Hn"
			},
			{
				"id": "Q4q9ALM",
				"role": "DevOps Manager",
				"company_name": "Afero",
				"company_num_employees": null,
				"employment_type": null,
				"location": "Los Altos, CA",
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/Q4q9ALM/devops-manager-at-afero",
				"text": "Afero enables connected devices to be smart and secure. Afero&#x27;s IoT Platform as a Service prioritizes security, data privacy, simplicity, and ease of use throughout the end user experience. These key elements are integral to the solution and not bolted on after the fact, enabling manufacturers and brands to secure their supply chain. Afero technology powers millions of devices across 150 product categories from 50+ manufacturers, including from well known brands like Defiant, Hampton Bay and EcoSmart. Afero has assembled world-class mobile, hardware, security, and cloud veterans from Google, Apple, Nest, Danger, Microsoft, Amazon, Twitter, and Netflix, Roku. To learn more about Afero, please visit www.afero.io.<br>Here is more about the roles we are currently hiring for:\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;afero\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;afero</a>",
				"date_posted": "2024-05-01T23:06:32Z",
				"keywords": [
					"nest"
				],
				"source": "Hn"
			},
			{
				"id": "XkRga8M",
				"role": "Software Engineers",
				"company_name": "ManageXR [https://www.managexr.com]",
				"company_num_employees": null,
				"employment_type": null,
				"location": "Full Time (San Francisco)",
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/XkRga8M/software-engineers-at-managexr-httpswwwmanagexrcom",
				"text": "tl;dr - Help deploy VR + AR devices at scale. Learn a lot, work on interesting problems with us as we grow. If you want to chat, email john (at) managexr<br>At ManageXR, we&#x27;re building the core infrastructure that enables organizations to benefit from VR and AR technology. As more enterprises use XR to train employees, doctors use XR to treat patients, and schools use XR to teach students, organizations face significant hurdles expanding their operations from early-stage pilots to organization-wide solutions. With ManageXR, our customers can effectively use XR at scale.<br>Full job description: <a href=\"https:&#x2F;&#x2F;wellfound.com&#x2F;company&#x2F;managexr\" rel=\"nofollow\">https:&#x2F;&#x2F;wellfound.com&#x2F;company&#x2F;managexr</a>",
				"date_posted": "2024-05-02T00:14:53Z",
				"keywords": [],
				"source": "Hn"
			},
			{
				"id": "n5ZWAeQ",
				"role": "Senior Software Engineer",
				"company_name": "Explo",
				"company_num_employees": null,
				"employment_type": null,
				"location": "NYC or SF",
				"remote": false,
				"logo": null,
				"url": "https://findwork.dev/n5ZWAeQ/senior-software-engineer-at-explo",
				"text": "Explo builds customer-facing dashboards and analytics. We are a Series A company backed by Craft, Felicis, and YC. We are growing quickly and looking to bring on strong leaders to our team!<br>Please email recruiting[at]explo[dot]co if you are interested and mention you found us through HackerNews.",
				"date_posted": "2024-05-02T00:04:59Z",
				"keywords": [],
				"source": "Hn"
			}
		]
	}
]