[{"data":1,"prerenderedAt":167},["Reactive",2],{"jobList":3},[4,20,32,41,53,62,73,81,94,106,116,127,136,146,156],{"id":5,"role":6,"company_name":7,"company_num_employees":8,"employment_type":9,"location":8,"remote":10,"logo":8,"url":11,"text":12,"date_posted":13,"keywords":14,"source":18,"url_company":19},"Xxq6rYn","Product Designer","Zen Educate",null,"full time",true,"https://dribbble.com/jobs/251138-Product-Designer?utm_source=findwork.dev&ref=findwork.dev&utm_medium=jobposting","\u003Cp>\u003Cstrong>Location: London (Oval), incl. flex, United Kingdom\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Type: Full-time\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Salary: £50,000- £65,000\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>About us:\u003C/strong>\u003C/p>\u003Cp>Zen is revolutionising education. Schools spend over £2bn a year on agency staff, and £600m of that goes straight into the pockets of recruitment agencies. That’s why we’ve built an alternative. \u003C/p>\u003Cp>Our online platform gives schools instant access to hundreds of profiles of fully vetted teachers and support staff. Since launching in 2017, we’ve saved schools over £10m – money that goes straight back into school budgets and increases teachers’ pay.\u003C/p>\u003Cp>\u003Cstrong>The opportunity:\u003C/strong>\u003C/p>\u003Cp>This is your chance to join a tech startup in hypergrowth. We’re passionate about professional development, and we’ll work to maximise your personal and career growth.\u003C/p>\u003Cp>\u003Cstrong>Looking to make a difference?\u003C/strong>\u003C/p>\u003Cp>You’ll be joining Zen in a key position. Product is at the heart of how we deliver for schools and teachers and you’ll play a key role in building and running our product function to make sure we are creating the right thing and doing it right. We’re still young and you’ll play a significant role in the development of the company and team.\u003C/p>\u003Cp>The product delivery team is a crucial part of how Zen will help both transform the supply and recruitment experience for schools and generate the savings the education system needs. This is a great opportunity for someone looking to apply themselves for a great cause and with great responsibility and autonomy to shape the product for years to come.\u003C/p>\u003Cp>\u003Cstrong>What we are looking for\u003C/strong>\u003C/p>\u003Cp>- Top performer that wants to be part of a high-performing, motivated team\u003C/p>\u003Cp>- Growth mindset – dedicated to improving your skills as a professional \u003C/p>\u003Cp>- Passion for building great products and companies that have a positive social impact \u003C/p>\u003Cp>- Strong bias to action\u003C/p>\u003Cp>- Excellent people skills for working with both our customers and teams at Zen\u003C/p>\u003Cp>\u003Cstrong>What you’ll be doing\u003C/strong>\u003C/p>\u003Cp>Working on both our core platform at Zen Educate & Zen Locum as well as our additional software services, you will be:\u003C/p>\u003Cp>- Working in a multidisciplinary delivery team\u003C/p>\u003Cp>- Conducting Customer Research\u003C/p>\u003Cp>- Making designs, prototyping and wireframing\u003C/p>\u003Cp>- Working with and building design systems\u003C/p>\u003Cp>- Working closely with developers and product managers to test designs and see them to production as intended\u003C/p>\u003Cp>\u003Cstrong>Ideal experience\u003C/strong>\u003C/p>\u003Cp>- UX/UI design experience including wire-framing, building high-fidelity mock-ups, and applying design thinking to solve business problems\u003C/p>\u003Cp>- Experience with Figma and Adobe Creative Suite\u003C/p>\u003Cp>- Some knowledge of HTML/CSS, Sketch is a plus\u003C/p>\u003Cp>- Prior experience designing and building products\u003C/p>\u003Cp>- Strong communication skills, comfortable walking through designs to the team and the company\u003C/p>\u003Cp>- History of creating products with strong user experience and high-quality design\u003C/p>\u003Cp>\u003Cstrong>What's in it for you?\u003C/strong>\u003C/p>\u003Cp>- Work that you want to talk about\u003C/p>\u003Cp>- Competitive salary\u003C/p>\u003Cp>- Ownership in the company\u003C/p>\u003Cp>- 25 days of holiday\u003C/p>\u003Cp>- Central London office with perks like fresh fruit, yoga classes, bike parking, showers and an on-site gym and café\u003C/p>\u003Cp>- Fun-loving, tight-knit team solving a problem that makes a difference\u003C/p>\u003Cp>- 1-1 coaching\u003C/p>\u003Cp>- Life Insurance\u003C/p>\u003Cp>- Health Insurance\u003C/p>\u003Cp>- Electric Car Scheme \u003C/p>\u003Cp>- Cycle to Work Scheme \u003C/p>\u003Cp>\u003Cstrong>We can’t wait to hear from you!\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Diversity and Inclusion\u003C/strong>\u003C/p>\u003Cp>At Zen, we strive to build a culture of equity and inclusion, where everyone is respected, valued and appreciated for their unique traits, experiences and perspectives. We are committed to creating a safe, inclusive and equitable environment where our team can thrive, regardless of age, ethnicity, race, gender identity, sexual orientation, socio-economic status, disability, religion or beliefs. We value our differences and believe that practices of Diversity, Equity and Inclusion help us create a fairer, more compassionate environment for all. \u003C/p>",["Date","2024-05-03T10:23:01.000Z"],[15,16,17],"ux","figma","sketch","Dribbble","https://dribbble.com/",{"id":21,"role":22,"company_name":23,"company_num_employees":8,"employment_type":8,"location":24,"remote":25,"logo":8,"url":26,"text":27,"date_posted":28,"keywords":29,"source":31,"url_company":8},"MrJKbKM","Engineer","Aldara","Onsite (Barcelona, Spain)",false,"https://findwork.dev/MrJKbKM/engineer-at-aldara","Hi, I&#x27;m Dani, Aldara cofounder. At Aldara we build software to manage HOAs and handle everything they need in their day-to-day. We make neighbor communities happy by handling their finances, incidents, and communications swiftly and effectively. We invest heavily in product and growth to become the building OS for the European real estate market.\u003Cbr>Right now the eng team is made up of three very efficient, independent engineers who have built 5 products to support the customer&#x27;s needs. We value a high sense of ownership and relentless curiosity. We want passionate builders who we also love as human beings. Join us pre series A for a significant stake in the game!\u003Cbr>See more about the offer here \u003Ca href=\"https:&#x2F;&#x2F;www.ycombinator.com&#x2F;companies&#x2F;aldara&#x2F;jobs&#x2F;4DCmIVs-software-engineer\">https:&#x2F;&#x2F;www.ycombinator.com&#x2F;companies&#x2F;aldara&#x2F;jobs&#x2F;4DCmIVs-so...\u003C/a>\u003Cbr>Work is on site, working level of spanish is recommended. We&#x27;re not doing visas at the moment.",["Date","2024-05-03T09:09:30.000Z"],[30],"moment","Hn",{"id":33,"role":34,"company_name":35,"company_num_employees":8,"employment_type":8,"location":36,"remote":10,"logo":8,"url":37,"text":38,"date_posted":39,"keywords":40,"source":31,"url_company":8},"nKJgl5X","Senior Platform Engineer","SurrealDB","London, UK","https://findwork.dev/nKJgl5X/senior-platform-engineer-at-surrealdb","We are hiring at SurrealDB if anyone is interested in Databases.\u003Cbr>We are building a modern multi-modal distributed OLTP DB from scratch. Massive adoption already and a very ambitious roadmap.\u003Cbr>I&#x27;m looking for people that can help us build the Cloud offering, focusing on Infrastructure automation and reliability.\u003Cbr>We have an office in London and also accept remote (European timezone preferably)\u003Cbr>If interested, apply here: \u003Ca href=\"https:&#x2F;&#x2F;careers.surrealdb.com&#x2F;senior-platform-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.surrealdb.com&#x2F;senior-platform-engineer\u003C/a>",["Date","2024-05-03T08:03:49.000Z"],[],{"id":42,"role":43,"company_name":44,"company_num_employees":8,"employment_type":9,"location":8,"remote":10,"logo":45,"url":46,"text":47,"date_posted":48,"keywords":49,"source":52,"url_company":8},"XRLKWxQ","Field Engineering Senior Manager","Dynamo AI","https://findwork-dev-images.s3.amazonaws.com/full/1cda360e2326432aa29372700cb8d12b54600df4.jpg","https://findwork.dev/XRLKWxQ/field-engineering-senior-manager-at-dynamo-ai","\u003Cp>\u003Cstrong>→ UPDATE: Only applications submitted to \u003Ca href=\"https://dynamo.ai/apply-now\">\u003Cstrong>https://dynamo.ai/apply-now\u003C/strong>\u003C/a> will be considered.\u003C/strong>\u003C/p>\n\u003Cp>We are seeking a strategic and innovative Field Engineering Senior Manager to build our Field Engineering team. Reporting directly to the Head of Growth, you will be responsible for driving technical sales strategies, enabling customers to successfully integrate our AI solutions into their environments, and ensuring the highest levels of customer satisfaction.​​\u003C/p>\n\u003Ch2>Responsibilities\u003C/h2>\n\u003Cul>\n\u003Cli>\n\u003Cstrong>Build and Lead Field Engineering Team:\u003C/strong> Develop the structure and processes for the Field Engineering team, including hiring, onboarding, and mentoring team members.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Technical Sales Leadership:\u003C/strong> Collaborate with the Sales team to develop and execute technical sales strategies that drive revenue growth and meet company objectives.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Customer Engagement:\u003C/strong> Engage directly with customers to understand their technical requirements, demonstrate product capabilities, and assist in solution design.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Product Alignment:\u003C/strong> Work closely with Product Management and Engineering teams to ensure that technical sales processes and approaches are aligned with the product vision and capabilities.\u003C/li>\n\u003Cli>\n\u003Cstrong>Product Evangelism:\u003C/strong> Act as a technical evangelist for our products, showcasing their value and differentiation in the market through presentations, demos, and other means.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Cross-Functional Collaboration:\u003C/strong> Collaborate with Product Management, Engineering, and Customer Success teams to ensure alignment between customer requirements and product development.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Continuous Improvement:\u003C/strong> Identify areas for improvement in the sales process, product offerings, and customer engagement to drive continuous improvement and innovation.\u003C/li>\n\u003C/ul>\n\u003Ch2>Qualifications\u003C/h2>\n\u003Cul>\n\u003Cli>Bachelor’s degree in Computer Science, Engineering, or a related field. Master’s degree preferred.​\u003C/li>\n\u003Cli>8+ years of experience in a technical pre-sales or field engineering role, with at least 3 years in a leadership capacity.​\u003C/li>\n\u003Cli>Deep understanding and hands-on experience with AI, machine learning, and cloud computing technologies.​\u003C/li>\n\u003Cli>Proficiency in container technologies such as Docker and Kubernetes, with experience in deploying and managing containerized applications.​\u003C/li>\n\u003Cli>Proven track record of leading successful technical sales engagements and driving revenue growth.​\u003C/li>\n\u003Cli>Strong communication and presentation skills, with the ability to effectively convey technical concepts to non-technical audiences.​\u003C/li>\n\u003Cli>Experience working with cross-functional teams in a fast-paced, dynamic environment.​\u003C/li>\n\u003Cli>Strong leadership and team-building skills, with a focus on developing and growing a high-performing team.\u003C/li>\n\u003C/ul>\n",["Date","2024-05-03T07:56:29.000Z"],[50,51],"docker","kubernetes","Ycombinator",{"id":54,"role":55,"company_name":44,"company_num_employees":8,"employment_type":9,"location":8,"remote":10,"logo":45,"url":56,"text":57,"date_posted":58,"keywords":59,"source":52,"url_company":8},"Mb9RdgQ","Customer Success Senior Manager","https://findwork.dev/Mb9RdgQ/customer-success-senior-manager-at-dynamo-ai","\u003Cp>\u003Cstrong>→ UPDATE: Only applications submitted to \u003Ca href=\"https://dynamo.ai/apply-now\">\u003Cstrong>https://dynamo.ai/apply-now\u003C/strong>\u003C/a> will be considered.\u003C/strong>\u003C/p>\n\u003Cp>We are seeking a strategic Customer Success Senior Manager to build our Customer Success team. Reporting directly to the Head of Growth, you will be responsible for fostering long-term relationships with our clients, ensuring their success and satisfaction with our AI solutions, along with driving customer retention and growth.​\u003C/p>\n\u003Ch2>Responsibilities\u003C/h2>\n\u003Cul>\n\u003Cli>\n\u003Cstrong>Build and lead Customer Success Team:\u003C/strong> Build and lead the Customer Success team, providing guidance and support to ensure the team delivers exceptional service and support to our clients.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Customer Relationship Management:\u003C/strong> Develop and maintain relationships with key clients, serving as the primary point of contact for escalations and strategic discussions.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Customer Onboarding and Adoption:\u003C/strong> Oversee the customer onboarding process to ensure a smooth transition from Sales to Customer Success. Implement strategies that drive product adoption and utilization.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Customer Advocacy:\u003C/strong> Act as the voice of the customer within the company, ensuring that customer feedback is heard and acted upon to improve product offerings and customer experience.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Retention and Growth Strategies:\u003C/strong> Develop and execute strategies to increase customer retention and reduce churn. Identify upsell and cross-sell opportunities by understanding customer needs and aligning them with our product offerings.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Performance Management:\u003C/strong> Establish key performance indicators (KPIs) for the Customer Success team and regularly track and report on these metrics to assess team performance and customer health.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Cross-Functional Collaboration:\u003C/strong> Collaborate with Sales, Product Management, and Engineering teams to ensure alignment between customer requirements and product development.​\u003C/li>\n\u003Cli>\n\u003Cstrong>Continuous Improvement:\u003C/strong> Identify areas for improvement in the customer experience and customer success processes, driving continuous improvement and innovation.​\u003C/li>\n\u003C/ul>\n\u003Ch2>Qualifications\u003C/h2>\n\u003Cul>\n\u003Cli>Bachelor’s degree in Business Administration, Marketing, or a related field.​\u003C/li>\n\u003Cli>At least 8-10 years of experience in customer success or a related field, with a proven track record of leading a customer success team in a technology-driven environment.​\u003C/li>\n\u003Cli>Strong understanding of customer success metrics and the ability to link them to business outcomes.​\u003C/li>\n\u003Cli>Excellent interpersonal and communication skills, with the ability to build relationships and influence both customers and internal stakeholders.​\u003C/li>\n\u003Cli>Demonstrated ability to manage and inspire a team in a dynamic and fast-paced setting.​\u003C/li>\n\u003Cli>Proficient in CRM and Customer Success software platforms such as Salesforce or Hubspot\u003C/li>\n\u003C/ul>\n",["Date","2024-05-03T07:51:39.000Z"],[60,61],"hubspot","salesforce",{"id":63,"role":64,"company_name":65,"company_num_employees":66,"employment_type":67,"location":8,"remote":10,"logo":68,"url":69,"text":70,"date_posted":71,"keywords":72,"source":18,"url_company":8},"MBjRD7M","Marketing Designer (Part-time/Freelance)","BRYTER","11-50","contract","https://findwork-dev-images.s3.amazonaws.com/BRYTER","https://findwork.dev/MBjRD7M/marketing-designer-part-timefreelance-at-bryter","\u003Cp>As a remote, freelance Marketing Designer at BRYTER you will play a key role in developing and executing visually engaging marketing materials. Working closely with others in the Marketing Team (Content, Demand Generation, Technical Website Manager) you will contribute to creating a creative, engaging and consistent brand identity across various channels – from paid social campaigns to e-books and webpages.\u003C/p>\u003Cp>You are a high-energy designer who enjoys the challenges and opportunities B2B marketing presents. In a world of boring stock photos, you like to be the one creating a visual aesthetic that pushes boundaries and brings fun, energy and creativity into B2B Marketing (and to the legal and compliance industries!), while doing so in a way consistent with the brand.\u003C/p>\u003Cp>In this role you will report directly to the VP of Marketing and work closely with the founders and the Product Design team as the person responsible for the visual aesthetic of the BRYTER brand.\u003C/p>\u003Cp>We initially expect this role to be part-time (i.e., 3 days per week).\u003C/p>\u003Cp>\u003C/p>\u003Cp>\u003C/p>\u003Cp>\u003Cstrong>What you’ll do\u003C/strong>\u003C/p>\u003Cul>\u003Cli>\u003Cp>Develop engaging and visually striking assets to support marketing efforts across platforms and channels: paid social media campaigns (LinkedIn Ads), collateral (e.g., e-books and PDFs), presentations and landing pages.\u003C/p>\u003C/li>\u003Cli>\u003Cp>Create elements for our website and landing pages.\u003C/p>\u003C/li>\u003Cli>\u003Cp>Work closely with others in the Marketing Team: Content, Demand Generation and our Technical Website Owner, as well as cross-functionally (Product Design) and directly with the founders to create assets that support our Marketing Strategy.\u003C/p>\u003C/li>\u003Cli>\u003Cp>Manage and execute on multiple projects, deadlines and communication in a fast-moving start-up environment.\u003C/p>\u003C/li>\u003C/ul>\u003Cp> \u003C/p>\u003Cp>\u003Cstrong>What we’re looking for\u003C/strong>\u003C/p>\u003Cul>\u003Cli>\u003Cp>A strong portfolio that shows your visual design skills.\u003C/p>\u003C/li>\u003Cli>\u003Cp>3+ years in marketing design roles (or similar).\u003C/p>\u003C/li>\u003Cli>\u003Cp>The ability to bring energy and creativity to a traditional industry (Legal/ Compliance and B2B).\u003C/p>\u003C/li>\u003Cli>\u003Cp>Digital and print expertise: trained in creating assets for both digital and print mediums.\u003C/p>\u003C/li>\u003Cli>\u003Cp>Strong communication skills, both written and verbal.\u003C/p>\u003C/li>\u003Cli>\u003Cp>Fluent English speaker\u003C/p>\u003C/li>\u003C/ul>\u003Cp> \u003C/p>\u003Cp>\u003Cstrong>What is it like to work at BRYTER?\u003C/strong> \u003C/p>\u003Cp>We are a remote-first Software-as-a-Service company, with people across UK, Europe, and the USA. We believe that teams are more important than businesses and we are convinced that the right team can have the greatest impact. Our management team has successfully built, scaled and sold companies before and wants to create an environment where everyone can grow to their full potential and flourish. \u003C/p>\u003Cp>We want our team members to take responsibility, to understand the mission and, ultimately, to be happy. That is why our organization is optimized to foster employee happiness, allowing everyone to have as much ownership, autonomy and mastery as possible. If you want to hear it straight from the horse’s mouth on what this means, how working at BRYTER is like, our CPO and Co-Founder Michael Hübl has \u003Ca href=\"https://bryter.io/press-news/how-to-remote-with-bryter/\" rel=\"nofollow noreferrer\">\u003Cstrong>recorded a webinar\u003C/strong>\u003C/a>, where he shares a bit about our remote-first working culture. \u003C/p>\u003Cp>Being remote-first means we work extra hard to foster relationships, including weekly check-ins, at a team and company level, and an in-person get-together twice per year where we spend the time strategizing, planning as well as just talking, having fun and getting to know each other better. Last time we did this was in Tuscany, and prior to that it was on a beach in Portugal!\u003C/p>",["Date","2024-05-03T05:58:06.000Z"],[],{"id":74,"role":75,"company_name":76,"company_num_employees":8,"employment_type":9,"location":8,"remote":10,"logo":8,"url":77,"text":78,"date_posted":79,"keywords":80,"source":18,"url_company":8},"MmjbKLX","Designer","Prepaire Laboratory","https://findwork.dev/MmjbKLX/designer-at-prepaire-laboratory","\u003Cp>We're looking for an experienced UX/UI designer who can design a whole web/app.\u003C/p>\u003Cp>Send us a DM or email your CVs/Portfolios to \u003Ca href=\"mailto:accounts@prepaire.com\" rel=\"nofollow noreferrer\">accounts@prepaire.com\u003C/a>. Make sure to mention your starting date, if hired. \u003C/p>\u003Cp>Note: We are NOT looking for a design firm, we need an individual designer.\u003C/p>\u003Cp>\u003C/p>",["Date","2024-05-03T05:54:55.000Z"],[15],{"id":82,"role":83,"company_name":84,"company_num_employees":8,"employment_type":8,"location":8,"remote":10,"logo":8,"url":85,"text":86,"date_posted":87,"keywords":88,"source":31,"url_company":8},"MdVyvpn","Senior Front End Engineer","holi.social","https://findwork.dev/MdVyvpn/senior-front-end-engineer-at-holisocial","Hi, Daniel here, Head of Engineering @ \u003Ca href=\"https:&#x2F;&#x2F;holi.social\" rel=\"nofollow\">https:&#x2F;&#x2F;holi.social\u003C/a>. holi is the digital space where people and organisations come together to act for common good. We&#x27;re dedicated to fostering a new digital ecosystem that empowers people to engage in impactful social projects while providing a digital home for social initiatives.\u003Cbr>Go check it out at\nPlay Store: \u003Ca href=\"https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=social.holi.ap\">https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=social.holi.ap\u003C/a>...\nApp Store: \u003Ca href=\"https:&#x2F;&#x2F;apps.apple.com&#x2F;xk&#x2F;app&#x2F;holi-social-eco-impact&#x2F;id64466\" rel=\"nofollow\">https:&#x2F;&#x2F;apps.apple.com&#x2F;xk&#x2F;app&#x2F;holi-social-eco-impact&#x2F;id64466\u003C/a>...\nWeb: \u003Ca href=\"https:&#x2F;&#x2F;app.holi.social\" rel=\"nofollow\">https:&#x2F;&#x2F;app.holi.social\u003C/a>\u003Cbr>We&#x27;re on the lookout for a *Senior Front End Engineer* to join our growing tech team and be a part of our inspiring journey:\n\u003Ca href=\"https:&#x2F;&#x2F;projectholi.jobs.personio.de&#x2F;job&#x2F;1499620?language=de&amp;display=en\" rel=\"nofollow\">https:&#x2F;&#x2F;projectholi.jobs.personio.de&#x2F;job&#x2F;1499620?language=de...\u003C/a>...\u003Cbr>The front ends are being developed cross-platform in TypeScript using React Native for mobile in combination with React Native for Web and Next.JS for web. The backend consists of a mix of a few open-source components in different languages (currently mostly TypeScript &amp; Python). We use Google Cloud Platform (GCP) as a cloud provider and Terraform for provisioning our services.\u003Cbr>At holi, our team truly values a workplace where we can openly communicate and connect, using language that includes everyone. We appreciate the different perspectives that team members bring, and we create an atmosphere where new ideas are welcome. Learning is a continuous journey, and we&#x27;re all about sharing knowledge and making decisions together. We&#x27;re a close-knit team, helping and supporting each other while keeping things simple and practical rather than seeking perfection. We have zero tolerance for toxic or egoistic behavior, as we prioritize collaboration and positivity. Our main focus is on making a positive impact and prioritizing people over profits.",["Date","2024-05-03T04:11:46.000Z"],[89,90,91,92,93],"gcp","typescript","terraform","react","python",{"id":95,"role":96,"company_name":97,"company_num_employees":98,"employment_type":9,"location":8,"remote":10,"logo":99,"url":100,"text":101,"date_posted":102,"keywords":103,"source":105,"url_company":8},"XzZzRbX","Investment & Research Analyst","Chorus One","1-10","https://findwork-dev-images.s3.amazonaws.com/full/9854badd84c87f1efdda3c8c28ad8a8b82951c02.jpg","https://findwork.dev/XzZzRbX/investment-research-analyst-at-chorus-one","\u003Cp>We are hiring an \u003Cstrong>Investment & Research Analyst\u003C/strong> to join our fully remote team to focus on early-stage investment opportunities for Chorus One Ventures. As an \u003Cstrong>Investment & Research Analyst\u003C/strong> you will spend time sourcing, analyzing, and evaluating investment opportunities, while also working closely with portfolio companies & network foundations. Identifying, analyzing, and understanding new markets & technology trends within the blockchain industry will be a core part of your work. This is an exciting chance to work in an established, ambitious, and highly collaborative team, and to take on significant responsibility quickly.\u003C/p>\u003Ch2>Responsibilities\u003C/h2>\u003Cul>\u003Cli>Sourcing and proactively identifying new investment opportunities\u003C/li>\u003Cli>Qualifying inbound leads for Chorus One Ventures by meeting with founders\u003C/li>\u003Cli>Evaluate and diligence new investment opportunities through conversations, market research, technology/architecture reviews, competitive analysis, etc.\u003C/li>\u003Cli>Help maintain our database and deal pipeline with current information\u003C/li>\u003Cli>Be responsible for the qualitative and quantitative analysis of various investment opportunities\u003C/li>\u003Cli>Conduct deep research within areas of focus and help synthesize learnings into insightful content\u003C/li>\u003Cli>Assist in supporting Chorus One portfolio companies and help maintain & build relationships with various network foundations for dealflow & staking opportunities\u003C/li>\u003Cli>Support the rest of the ventures team in due diligence procedures, research and financial modeling\u003C/li>\u003Cli>Pitching in on various firm related projects\u003C/li>\u003C/ul>\u003Ch2>What you offer\u003C/h2>\u003Cul>\u003Cli>Self-starter mentality with a proven ability to take initiative and operate with little oversight / be self-guided on a day-to-day basis\u003C/li>\u003Cli>A demonstrated history of being proactive and being a strong team player who fits in with our team’s low-ego culture\u003C/li>\u003Cli>Ability to digest new technical, market & other industry information quickly and precisely\u003C/li>\u003Cli>Strong written and verbal analytical & communication skills for deal analysis and internal reporting\u003C/li>\u003Cli>A native understanding of blockchain technology with experience reviewing white papers or crypto projects\u003C/li>\u003Cli>Deep understanding of one or more subareas of crypto infrastructure or related technical fields, such as consensus, L2s, economics, decentralized storage, etc.\u003C/li>\u003Cli>The ability to think analytically and strategically about investment decisions and ongoing work with existing portfolio companies\u003C/li>\u003Cli>Strong relationship building skills as we are connecting with entrepreneurs and other members of the community on a regular basis\u003C/li>\u003Cli>An active user of crypto applications and protocols\u003C/li>\u003Cli>Financial modeling capability or data science background is a plus\u003C/li>\u003Cli>Experience working for a crypto venture firm and understand venture capital and crypto deal terms is a plus\u003C/li>\u003C/ul>\u003Cp>Job Type: Full-time\u003C/p>\u003Ch2>Benefits\u003C/h2>\u003Cul>\u003Cli>Autonomy, a friendly and supportive work environment and the opportunity for rapid growth\u003C/li>\u003Cli>Competitive fixed salary (USD 85k - USD 130k) + equity\u003C/li>\u003Cli>Learning Budget 3,000 CHF / year\u003C/li>\u003Cli>Conference Budget\u003C/li>\u003Cli>Unlimited PTO\u003C/li>\u003Cli>All-expense paid bi-annual team retreats at nice destinations. Past retreats took place in Portugal, Kenya, USA, South Korea, Dubai, Georgia, Thailand, Serbia.\u003C/li>\u003Cli>Remote, but not alone. We are a strong global collaborative team\u003C/li>\u003Cli>Expand your network and work with some of the most important players in the vibrant crypto ecosystem\u003C/li>\u003Cli>Work on and with state of the art protocols that lay the foundation for an open, transparent, and programmable financial system\u003C/li>\u003C/ul>",["Date","2024-05-03T04:00:00.000Z"],[104],"blockchain","Cryptocurrencyjobs",{"id":107,"role":108,"company_name":109,"company_num_employees":8,"employment_type":9,"location":110,"remote":25,"logo":111,"url":112,"text":113,"date_posted":114,"keywords":115,"source":105,"url_company":8},"MAdolgQ","Senior Ecosystem Growth Manager","Ripple","Singapore, Singapore","https://findwork-dev-images.s3.amazonaws.com/full/29cf3e97dc6e4e4f4f66d919025965bef2ff29f7.jpg","https://findwork.dev/MAdolgQ/senior-ecosystem-growth-manager-at-ripple","Ripple is looking to hire a Senior Ecosystem Growth Manager to join their team. This is a full-time position that is based in Singapore.",["Date","2024-05-03T04:00:00.000Z"],[],{"id":117,"role":118,"company_name":119,"company_num_employees":120,"employment_type":9,"location":121,"remote":25,"logo":122,"url":123,"text":124,"date_posted":125,"keywords":126,"source":105,"url_company":8},"nvD1vLM","Senior Associate, Advanced Trading & International Exchange","Coinbase","251-500","London, United Kingdom","https://findwork-dev-images.s3.amazonaws.com/full/92fc80a1d7a4d84514538ce6749609fe9c1b7b12.jpg","https://findwork.dev/nvD1vLM/senior-associate-advanced-trading-international-exchange-at-coinbase","Coinbase is looking to hire a Senior Associate, Advanced Trading & International Exchange to join their team. This is a full-time position that is based in London.",["Date","2024-05-03T04:00:00.000Z"],[],{"id":128,"role":129,"company_name":130,"company_num_employees":8,"employment_type":8,"location":8,"remote":10,"logo":131,"url":132,"text":133,"date_posted":134,"keywords":135,"source":105,"url_company":8},"XlLV3EX","Research Engineering Internship (Formal Methods)","SupraOracles","https://findwork-dev-images.s3.amazonaws.com/full/baa0b3e0e1cb04ca1325973a4e31f8e120777b8d.jpg","https://findwork.dev/XlLV3EX/research-engineering-internship-formal-methods-at-supraoracles","SupraOracles is looking to hire a Research Engineering Internship (Formal Methods) to join their team. This is an internship position that is 100% remote with no geographical restrictions. Work remotely from anywhere.",["Date","2024-05-03T04:00:00.000Z"],[],{"id":137,"role":138,"company_name":139,"company_num_employees":8,"employment_type":9,"location":140,"remote":25,"logo":141,"url":142,"text":143,"date_posted":144,"keywords":145,"source":105,"url_company":8},"MNN73LM","Director, Talent Development","Fireblocks","New York, United States","https://findwork-dev-images.s3.amazonaws.com/full/a7ef3e7536f20b92c1ef5d5412ce3fa486c3f323.jpg","https://findwork.dev/MNN73LM/director-talent-development-at-fireblocks","Fireblocks is looking to hire a Director, Talent Development to join their team. This is a full-time position that is based in New York NY.",["Date","2024-05-03T04:00:00.000Z"],[],{"id":147,"role":148,"company_name":149,"company_num_employees":8,"employment_type":9,"location":8,"remote":10,"logo":150,"url":151,"text":152,"date_posted":153,"keywords":154,"source":105,"url_company":8},"QGpqldM","Sales Development Representative","Liquify","https://findwork-dev-images.s3.amazonaws.com/full/18d5cd8d8ca0cbc710d3ddeae62da8f6e8028417.jpg","https://findwork.dev/QGpqldM/sales-development-representative-at-liquify","\u003Cp>For \u003Ca>Liquify\u003C/a> I’m looking for a \u003Cstrong>proactive\u003C/strong> Sales Development Representative (SDR) with a knowledge of crypto & decentralized tech!\u003C/p>\u003Cp>Be a vital part of an OG team, driving growth and revenue in an exciting tech space!\u003C/p>\u003Ch2>We’re looking for:\u003C/h2>\u003Cul>\u003Cli>Strong crypto and decentralized tech knowledge.\u003C/li>\u003Cli>Proven \u003Cstrong>SDR experience\u003C/strong> with outstanding results.\u003C/li>\u003Cli>Hungry for success!\u003C/li>\u003Cli>Exceptional communication and problem-solving skills.\u003C/li>\u003Cli>Independent, team-oriented, success-driven attitude.\u003C/li>\u003C/ul>\u003Ch2>Benefits:\u003C/h2>\u003Cul>\u003Cli>Competitive salary + commission\u003C/li>\u003Cli>Career growth opportunities (\u003Cstrong>you’ll be learning from OGs and developing a stellar network\u003C/strong>).\u003C/li>\u003Cli>Dynamic, supportive environment.\u003C/li>\u003C/ul>\u003Ch2>Interested and ready to make an impact?\u003C/h2>\u003Cp>Apply now: Send your CV to   \u003Ca>robert@liquify.io\u003C/a>.\u003C/p>\u003Ch2>More About Liquify\u003C/h2>\u003Cp>Infrastructure as a Service (IaaS)\u003C/p>\u003Cp>For institutional investors, foundations, and Web3 builders - grow your assets, communities, and revenue knowing your blockchain infrastructure is in the hands of experts.\u003C/p>\u003Cul>\u003Cli>\u003Ca>Liquify\u003C/a> ecosystem chains supported.\u003C/li>\u003C/ul>\u003Cp>\u003Cstrong>Bare metal\u003C/strong> Infrastructure as a Service\u003C/p>\u003Cul>\u003Cli>Nodes\u003C/li>\u003Cli>Validators\u003C/li>\u003Cli>RPC endpoints\u003C/li>\u003Cli>Snapshots\u003C/li>\u003Cli>SubGraphs\u003C/li>\u003Cli>Monitoring solutions and other custom tools.\u003C/li>\u003C/ul>\u003Cp>Currently supporting \u003Cstrong>60+ chains\u003C/strong> with over 1 billion RPC calls daily and \u003Cstrong>$300M million AUM.\u003C/strong>\u003C/p>\u003Cp>High uptime (99.95% guaranteed) as well as optimized throughput, latency, decentralization. Tier 3 and 4 data-centers span across Asia, US East and West, and Europe.\u003C/p>",["Date","2024-05-03T04:00:00.000Z"],[104,155],"web3",{"id":157,"role":158,"company_name":159,"company_num_employees":8,"employment_type":9,"location":8,"remote":10,"logo":160,"url":161,"text":162,"date_posted":163,"keywords":164,"source":105,"url_company":8},"Xxq6a0n","Growth Marketing Specialist","token.com","https://findwork-dev-images.s3.amazonaws.com/full/4b68e529a1ca712c2d75a024522571e1bfd28f13.jpg","https://findwork.dev/Xxq6a0n/growth-marketing-specialist-at-tokencom","\u003Cp>Hi, we’re token.com. Our goal is to create a world where money can flow effortlessly into the things people truly care about. token.com is the fun, simple, and social platform to discover and invest in the game-changing ventures of tomorrow. At token.com we recognise the positive value of diversity, we promote equality and challenge discrimination. We actively encourage job applications from people of all backgrounds.\u003C/p>\u003Cp>We’re a high-performance team of around 65 people. We have freedom and responsibility, a culture that encourages innovation, offers ownership and embraces knowledge sharing. We are now working as a team first, remote friendly company, arranging monthly get-togethers and regular team retreats. We also have a co-working space in London for collaboration and socialising.\u003C/p>\u003Cp>We are looking for a driven and creative Growth Marketing Specialist to join our Marketing team.\u003C/p>\u003Cp>To help you best prepare, we’ve outlined the interview process for this role, we aim to have this process completed within 3 weeks:\u003C/p>\u003Cul>\u003Cli>30 minute Google Meet with our People and Talent Coordinator\u003C/li>\u003Cli>60 minutes Google Meet with our Head of Growth\u003C/li>\u003Cli>60 minutes case study presentation\u003C/li>\u003Cli>Final 1 hour Google Meet with our VP of Marketing\u003C/li>\u003C/ul>\u003Ch2>About you:\u003C/h2>\u003Cp>What we’re looking for:\u003C/p>\u003Cul>\u003Cli>5+ years of experience driving growth for companies with paid and organic strategies\u003C/li>\u003Cli>2+ years of experience working with mobile app growth.\u003C/li>\u003Cli>Proficient in ASO and SEO for organic channel growth.\u003C/li>\u003Cli>Analytical Skills: Proficient in data analysis tools (Spreadsheets, SQL) and platforms (Looker, Amplitude, AppsFlyer, GA4).\u003C/li>\u003Cli>Results-Driven: You consistently surpass marketing goals, prioritising measurable outcomes and ROI.\u003C/li>\u003Cli>Analytical Skills: You adeptly utilise data tools and platforms for informed decision-making.\u003C/li>\u003Cli>Innovative Thinking: Your creativity shines in crafting unique marketing strategies.\u003C/li>\u003Cli>Adaptability: You swiftly adjust strategies in response to changing environments.\u003C/li>\u003Cli>Communication Skills: You excel in conveying complex ideas clearly and succinctly.\u003C/li>\u003Cli>You are fluent in English\u003C/li>\u003Cli>Web 3 and/or crypto Industry knowledge\u003C/li>\u003C/ul>\u003Ch2>What you’ll be doing:\u003C/h2>\u003Cul>\u003Cli>Develop and execute a comprehensive performance marketing strategy for user acquisition, engagement, and retention.\u003C/li>\u003Cli>Plan, brief, implement, and optimise digital marketing campaigns across paid social, SEM, Display, and affiliate networks.\u003C/li>\u003Cli>Effectively manage the performance marketing budget.\u003C/li>\u003Cli>Utilise analytics tools (AppsFlyer, Amplitude, GA4) to track, analyse, and report on campaign performance.\u003C/li>\u003Cli>Present regular reports to stakeholders with key metrics and achievements.\u003C/li>\u003Cli>Collaborate with CRM, product, design, and engineering teams to align marketing efforts with the product roadmap.\u003C/li>\u003Cli>Ensure consistent messaging and branding across all channels.\u003C/li>\u003Cli>Implement A/B testing to optimise ad creatives, website conversion rates, landing pages, and other campaign elements.\u003C/li>\u003Cli>Identify improvement opportunities based on performance data.\u003C/li>\u003Cli>Develop and implement user segmentation strategies for personalised marketing.\u003C/li>\u003Cli>Collaborate with data analytics teams for targeted campaigns.\u003C/li>\u003Cli>Oversee organic initiatives, including SEO and ASO, working with freelancers and agencies to boost organic channels.\u003C/li>\u003C/ul>\u003Cp>\u003Cstrong>Please note that we are not in the position to offer sponsorship for this role.\u003C/strong>\u003C/p>",["Date","2024-05-03T04:00:00.000Z"],[165,166],"sql","seo",1715895157584]